[{"id":"1","identifier":"CS 100","department_id":"50","name":"Freshman Orientation","credit":"Credit: 1 hours.","description":"Introduction to Computer Science as a field and career for computer science majors. Overview of the field and specific examples of problem areas and methods of solution."}, {"id":"2","identifier":"CS 101","department_id":"50","name":"Intro Computing: Engrg & Sci","credit":"Credit: 3 hours.","description":"Fundamental principles, concepts, and methods of computing, with emphasis on applications in the physical sciences and engineering. Basic problem solving and programming techniques; fundamental algorithms and data structures; use of computers in solving engineering and scientific problems. Intended for engineering and science majors. \nPrerequisite: MATH 220 or MATH 221."}, {"id":"3","identifier":"CS 105","department_id":"50","name":"Intro Computing: Non-Tech","credit":"Credit: 3 hours.","description":"Computing as an essential tool of academic and professional activities. Functions and interrelationships of computer system components: hardware, systems and applications software, and networks. Widely used application packages such as spreadsheets and databases. Concepts and practice of programming for the solution of simple problems in different application areas. Intended for non-science and non-engineering majors. \nPrerequisite: MATH 112."}, {"id":"4","identifier":"CS 125","department_id":"50","name":"Intro to Computer Science","credit":"Credit: 4 hours.","description":"Basic concepts in computing and fundamental techniques for solving computational problems. Intended as a first course for computer science majors and others with a deep interest in computing. \nPrerequisite: Three years of high school mathematics or MATH 112."}, {"id":"5","identifier":"CS 126","department_id":"50","name":"Software Design Studio","credit":"Credit: 3 hours.","description":"Fundamental principles and techniques of software development. Design, documentation, testing, and debugging software, with a significant emphasis on code review. \nCredit is not given for both CS 242 and CS 126. Prerequisite: CS 125. For majors only."}, {"id":"6","identifier":"CS 173","department_id":"50","name":"Discrete Structures","credit":"Credit: 3 hours.","description":"Discrete mathematical structures frequently encountered in the study of Computer Science. Sets, propositions, Boolean algebra, induction, recursion, relations, functions, and graphs. \nCredit is not given for both CS 173 and MATH 213. Prerequisite: One of CS 125, ECE 220; one of MATH 220, MATH 221."}, {"id":"7","identifier":"CS 196","department_id":"50","name":"Freshman Honors","credit":"Credit: 1 hours.","description":"Offered for honors credit in conjunction with other 100-level computer science courses taken concurrently. A special examination may be required for admission to this course. \nMay be repeated. Prerequisite: Concurrent registration in another 100-level computer science course (see Schedule)."}, {"id":"8","identifier":"CS 199","department_id":"50","name":"Undergraduate Open Seminar","credit":"Credit: 1 TO 5 hours.","description":""}, {"id":"9","identifier":"CS 210","department_id":"50","name":"Ethical & Professional Issues","credit":"Credit: 2 hours.","description":"Ethics for the computing profession. Ethical decision-making; licensing; intellectual property, freedom of information, and privacy. \nCredit is not given for both CS 210 and ECE 316. Prerequisite: CS 225. Junior standing required."}, {"id":"10","identifier":"CS 225","department_id":"50","name":"Data Structures","credit":"Credit: 4 hours.","description":"Data abstractions: elementary data structures (lists, stacks, queues, and trees) and their implementation using an object-oriented programming language. Solutions to a variety of computational problems such as search on graphs and trees. Elementary analysis of algorithms. \nPrerequisite: CS 125 or ECE 220; CS 173 or MATH 213."}, {"id":"11","identifier":"CS 233","department_id":"50","name":"Computer Architecture","credit":"Credit: 4 hours.","description":"Fundamentals of computer architecture: digital logic design, working up from the logic gate level to understand the function of a simple computer; machine-level programming to understand implementation of high-level languages; performance models of modern computer architectures to enable performance optimization of software; hardware primitives for parallelism and security. \nPrerequisite: CS 125 and CS 173; credit or concurrent enrollment in CS 225."}, {"id":"12","identifier":"CS 241","department_id":"50","name":"System Programming","credit":"Credit: 4 hours.","description":"Basics of system programming, including POSIX processes, process control, inter-process communication, synchronization, signals, simple memory management, file I\/O and directories, shell programming, socket network programming, RPC programming in distributed systems, basic security mechanisms, and standard tools for systems programming such as debugging tools. \nCredit is not given for both CS 241 and ECE 391. Prerequisite: CS 225; credit or concurrent registration in CS 233."}, {"id":"13","identifier":"CS 242","department_id":"50","name":"Programming Studio","credit":"Credit: 3 hours.","description":"Intensive programming lab intended to strengthen skills in programming. \nPrerequisite: CS 241."}, {"id":"14","identifier":"CS 296","department_id":"50","name":"Honors Course","credit":"Credit: 1 hours.","description":"Group projects for honors credit in computer science. Sections of this course are offered in conjunction with other 200-level computer science courses taken concurrently. A special examination may be required for admission to this course. \nMay be repeated. Prerequisite: Concurrent registration in another 200-level computer science course (see Schedule)."}, {"id":"15","identifier":"CS 357","department_id":"50","name":"Numerical Methods I","credit":"Credit: 3 hours.","description":"Fundamentals of numerical methods for students in science and engineering; floating-point computation, systems of linear equations, approximation of functions and integrals, the single nonlinear equation, and the numerical solution of ordinary differential equations; various applications in science and engineering; programming exercises and use of high quality mathematical library routines. \nSame as MATH 357. Credit is not given for CS 357 if credit for CS 450 has been earned. (Counts for advanced hours in LAS). Prerequisite: A 100-level computer science course; MATH 225 or MATH 415; MATH 241."}, {"id":"16","identifier":"CS 361","department_id":"50","name":"Probability & Statistics for Computer Science","credit":"Credit: 3 hours.","description":"Introduction to probability theory and statistics with applications to computer science. Topics include: visualizing datasets, summarizing data, basic descriptive statistics, conditional probability, independence, Bayes theorem, random variables, joint and conditional distributions, expectation, variance and covariance, central limit theorem. Markov inequality, Chebyshev inequality, law of large numbers, Markov chains, simulation, the PageRank algorithm, populations and sampling, sample mean, standard error, maximum likelihood estimation, Bayes estimation, hypothesis testing, confidence intervals, linear regression, principal component analysis, classification, and decision trees. \nSame as STAT 361. Credit is not given for both CS 361 and ECE 313. Prerequisite: MATH 220 or 221; credit or concurrent registration in MATH 225. For majors only."}, {"id":"17","identifier":"CS 374","department_id":"50","name":"Introduction to Algorithms & Models of Computation","credit":"Credit: 4 hours.","description":"Analysis of algorithms, major paradigms of algorithm design including recursive algorithms, divide-and-conquer algorithms, dynamic programming, greedy algorithms, and graph algorithms. Formal models of computation including finite automata and Turing machines. Limitations of computation arising from fundamental notions of algorithm and from complexity-theoretic constraints. Reductions, undecidability and NP-completeness. \nSame as ECE 374. Prerequisite: CS 225; MATH 225 or MATH 415."}, {"id":"18","identifier":"CS 397","department_id":"50","name":"Individual Study","credit":"Credit: 1 TO 3 hours.","description":"\nMay be repeated. Prerequisite: Consent of instructor."}, {"id":"19","identifier":"CS 411","department_id":"50","name":"Database Systems","credit":"Credit: 3 OR 4 hours.","description":"Examination of the logical organization of databases: the entity-relationship model; the hierarchical, network, and relational data models and their languages. Functional dependencies and normal forms. Design, implementation, and optimization of query languages; security and integrity; concurrency control, and distributed database systems. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"20","identifier":"CS 412","department_id":"50","name":"Introduction to Data Mining","credit":"Credit: 3 OR 4 hours.","description":"Concepts, techniques, and systems of data warehousing and data mining. Design and implementation of data warehouse and on-line analytical processing (OLAP) systems; data mining concepts, methods, systems, implementations, and applications. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"21","identifier":"CS 413","department_id":"50","name":"Intro to Combinatorics","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"22","identifier":"CS 418","department_id":"50","name":"Interactive Computer Graphics","credit":"Credit: 3 or 4 hours.","description":"Basic mathematical tools and computational techniques for modeling, rendering, and animating 3-D scenes. \nSame as CSE 427. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225; MATH 225 or MATH 415; MATH 241."}, {"id":"23","identifier":"CS 420","department_id":"50","name":"Parallel Progrmg: Sci & Engrg","credit":"Credit: 3 OR 4 hours.","description":"Fundamental issues in design and development of parallel programs for various types of parallel computers. Various programming models according to both machine type and application area. Cost models, debugging, and performance evaluation of parallel programs with actual application examples. \nSame as CSE 402 and ECE 492. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"24","identifier":"CS 421","department_id":"50","name":"Progrmg Languages & Compilers","credit":"Credit: 3 OR 4 hours.","description":"Structure of programming languages and their implementation. Basic language design principles; abstract data types; functional languages; type systems; object-oriented languages. Basics of lexing, parsing, syntax-directed translation, semantic analysis, and code generation. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 233 and CS 373."}, {"id":"25","identifier":"CS 424","department_id":"50","name":"Real-Time Systems","credit":"Credit: 3 OR 4 hours.","description":"Supervisory control aspects of Cyber Physical Systems (CPS): fundamentals of reliability analysis, real-time scheduling, simple feedback control, software fault tolerance architecture, wireless networking and energy saving, principles of safety critical system engineering. Student groups design and demonstrate supervisory control architecture for a robot. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241."}, {"id":"26","identifier":"CS 425","department_id":"50","name":"Distributed Systems","credit":"Credit: 3 OR 4 hours.","description":"Protocols, specification techniques, global states and their determination, reliable broadcast, transactions and commitment, security, and real-time systems. \nSame as ECE 428. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241 or ECE 391."}, {"id":"27","identifier":"CS 426","department_id":"50","name":"Compiler Construction","credit":"Credit: 3 OR 4 hours.","description":"Compiler structure, syntax analysis, syntax-directed translation, automatically constructed recognizers, semantic analysis, code generation, intermediate language, optimization techniques. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 421."}, {"id":"28","identifier":"CS 427","department_id":"50","name":"Software Engineering I","credit":"Credit: 3 OR 4 hours.","description":"Software process, analysis and design. Software development paradigms, system engineering, function-based analysis and design, and object-oriented analysis and design. Course will use team-projects for hands-on exercises. \nSame as CSE 426. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225 and CS 373."}, {"id":"29","identifier":"CS 431","department_id":"50","name":"Embedded Systems","credit":"Credit: 3 or 4 hours.","description":"A survey of sampled data systems and embedded architecture; key concepts in common embedded system applications; signal processing and control; embedded microprocessor and device interface; time-critical I\/O handling; data communications; real-time operating systems and techniques for the development and analysis of embedded real-time software; hands-on laboratory projects. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241 or ECE 391."}, {"id":"30","identifier":"CS 433","department_id":"50","name":"Computer System Organization","credit":"Credit: 3 OR 4 hours.","description":"Computer system analysis and design. Organizational dependence on computations to be performed; speed and cost of parts and overall machines; instruction set design; pipeline and vector machines; memory hierarchy design. \nSame as CSE 422. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 233."}, {"id":"31","identifier":"CS 438","department_id":"50","name":"Communication Networks","credit":"Credit: 3 OR 4 hours.","description":"Layered architectures and the OSI Reference Model; design issues and protocols in the transport, network, and data link layers; architectures and control algorithms of local-area, point-to-point, and satellite networks; standards in networks access protocols; models of network interconnection; overview of networking and communication software. \nSame as ECE 438. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241 or ECE 391; one of ECE 313, MATH 461, MATH 463."}, {"id":"32","identifier":"CS 439","department_id":"50","name":"Wireless Networks","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"33","identifier":"CS 440","department_id":"50","name":"Artificial Intelligence","credit":"Credit: 3 OR 4 hours.","description":"Major topics in and directions of research in artificial intelligence: AI languages (LISP and PROLOG), basic problem solving techniques, knowledge representation and computer inference, machine learning, natural language understanding, computer vision, robotics, and societal impacts. \nSame as ECE 448. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225 or ECE 391."}, {"id":"34","identifier":"CS 446","department_id":"50","name":"Machine Learning","credit":"Credit: 3 OR 4 hours.","description":"Theory and basic techniques in machine learning. Major theoretical paradigms and key concepts developed in machine learning in the context of applications such as natural language and text processing, computer vision, data mining, adaptive computer systems and others. Review of several supervised and unsupervised learning approaches: methods for learning linear representations; on-line learning, Bayesian methods; decision-trees; features and kernels; clustering and dimensionality reduction. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 373 and CS 440."}, {"id":"35","identifier":"CS 450","department_id":"50","name":"Numerical Analysis","credit":"Credit: 3 or 4 hours.","description":"Linear system solvers, optimization techniques, interpolation and approximation of functions, solving systems of nonlinear equations, eigenvalue problems, least squares, and quadrature; numerical handling of ordinary and partial differential equations. \nSame as CSE 401, ECE 491, and MATH 450. 3 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both CS 450 and CS 457. Prerequisite: CS 101 or CS 125; CS 357 or MATH 415; MATH 285."}, {"id":"36","identifier":"CS 461","department_id":"50","name":"Computer Security I","credit":"Credit: 0 to 4 hours.","description":"Fundamental principles of computer and communications security and information assurance: ethics, privacy, notions of threat, vulnerabilities, and risk in systems, information warfare, malicious software, data secrecy and integrity issues, network security, trusted computing, mandatory and discretionary access controls, certification and accreditation of systems against security standards. Security mechanisms: authentication, auditing, intrusion detection, access control, cryptography, security protocols, key distribution. \nSame as ECE 422. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241 or ECE 391."}, {"id":"37","identifier":"CS 465","department_id":"50","name":"User Interface Design","credit":"Credit: 3 OR 4 hours.","description":"A project-focused course covering fundamental principles of user interface design, implementation, and evaluation. Small teams work on a term-long project that involves: analysis of the problem domain, user skills, and tasks; iterative prototyping of interfaces to address user needs; conducting several forms of evaluation such as cognitive walkthroughs and usability tests; implementation of the final prototype. Non-technical majors may enroll as non-programmers who participate in all aspects of the projects with the possible exception of implementation. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"38","identifier":"CS 466","department_id":"50","name":"Introduction to Bioinformatics","credit":"Credit: 3 OR 4 hours.","description":"Algorithmic approaches in bioinformatics: (i) biological problems that can be solved computationally (e.g., discovering genes, and interactions among different genes and proteins); (ii) algorithmic techniques with wide applicability in solving these problems (e.g., dynamic programming and probabilistic methods); (iii) practical issues in translating the basic algorithmic ideas into accurate and efficient tools that biologists may use. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"39","identifier":"CS 476","department_id":"50","name":"Program Verification","credit":"Credit: 3 OR 4 hours.","description":"Formal methods for demonstrating correctness and other properties of programs. Invariant assertions; Hoare axiomatics; well-founded orderings for proving termination; structural induction; computational induction; data structures; parallel programs; overview of predicate calculus. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225; CS 373 or MATH 414."}, {"id":"40","identifier":"CS 477","department_id":"50","name":"Formal Software Devel Methods","credit":"Credit: 3 OR 4 hours.","description":"Mathematical models, languages, and methods for software specification, development, and verification. \nSame as ECE 478. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225; CS 373 or MATH 414."}, {"id":"41","identifier":"CS 481","department_id":"50","name":"Stochastic Processes & Applic","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"42","identifier":"CS 483","department_id":"50","name":"Applied Parallel Programming","credit":"Credit: 4 hours.","description":""}, {"id":"43","identifier":"CS 491","department_id":"50","name":"Seminar","credit":"Credit: 0 TO 4 hours.","description":"Seminar on topics of current interest as announced in the Class Schedule. \n0 to 4 undergraduate hours. 0 to 4 graduate hours. Approved for S\/U grading only. May be repeated in the same or separate terms if topics vary to a maximum of 4 hours. Prerequisite: As specified for each topic offering, see Class Schedule or departmental course description."}, {"id":"44","identifier":"CS 492","department_id":"50","name":"Senior Project I","credit":"Credit: 3 hours.","description":"First part of a project course in computer science. Students work in teams to solve typical commercial or industrial problems. Work involves planning, design, and implementation. Extensive oral and written work is required both on-campus and possibly off-campus at sponsors' locations. CS 492 must be taken as a sequence with either CS 493 or CS 494. \n3 undergraduate hours. No graduate credit. Credit is not given for both CS 492 and a project course in another engineering department for the same project. Prerequisite: For Computer Science majors with senior standing."}, {"id":"45","identifier":"CS 498","department_id":"50","name":"Special Topics","credit":"Credit: 1 to 4 hours.","description":"Subject offerings of new and developing areas of knowledge in computer science intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}, {"id":"46","identifier":"CS 499","department_id":"50","name":"Senior Thesis","credit":"Credit: 3 hours.","description":"Research and thesis development experience in computer science underguidance of a faculty member. Literature search, oral presentation, analysis and implementation, paper preparation, and completion of a written thesis. \n3 undergraduate hours. No graduate credit. May be repeated to a maximum of 6 hours. Prerequisite: Consent of instructor."}, {"id":"47","identifier":"CS 519","department_id":"50","name":"Scientific Visualization","credit":"Credit: 4 hours.","description":"Visualization techniques useful in analysis of engineering and scientific data. Physical models; methods of computational science; two- and three-dimensional data types; visual representation schemes for scalar, vector, and tensor data; isosurface and volume visualization methods; visual monitoring; interactive steering. \nSame as CSE 527. Prerequisite: CS 418."}, {"id":"48","identifier":"CS 523","department_id":"50","name":"Advanced Operating Systems","credit":"Credit: 4 hours.","description":"Advanced concepts in operating system design and coverage of recent research directions. Resource management for parallel and distributed systems. Interaction between operating system design and computer architectures. Process management, virtual memory, interprocess communication, context switching, parallel and distributed file system designs, persistent objects, process and data migration, load balancing, security, protection. Term projects. \nPrerequisite: CS 423, CS 425, and CS 433."}, {"id":"49","identifier":"CS 527","department_id":"50","name":"Topics in Software Engineering","credit":"Credit: 4 hours.","description":"Fault-tolerant software, software architecture, software patterns, multi-media software, and knowledge-based approaches to software engineering. Case studies. \nPrerequisite: CS 428 or CS 429."}, {"id":"50","identifier":"CS 541","department_id":"50","name":"Computer Systems Analysis","credit":"Credit: 4 hours.","description":""}, {"id":"51","identifier":"CS 548","department_id":"50","name":"Models of Cognitive Processes","credit":"Credit: 4 hours.","description":"Formal models and concepts in automated cognition; integrating machine learning and prior knowledge; current approaches and detailed analyses of the role of reasoning in the learning process; computational complexity and fundamental tradeoffs between expressiveness and tractability; implications for state-of-the-art artificial intelligence areas such as automated planning, the semantic web, relational learning, structured prediction, latent models, structure learning, theory formation, etc.; philosophical and psychological aspects of integrating analytic and empirical evidence. \nSame as ECE 548. Prerequisite: CS 440 or CS 446."}, {"id":"52","identifier":"CS 549","department_id":"50","name":"Seminar in Cognitive Science","credit":"Credit: 2 OR 4 hours.","description":""}, {"id":"53","identifier":"CS 556","department_id":"50","name":"Iterative & Multigrid Methods","credit":"Credit: 4 hours.","description":"Comprehensive treatment of algebraic and multigrid iterative methods to solve systems of equations, primarily linear equations arising from discretization of partial differential equations. "}, {"id":"54","identifier":"CS 563","department_id":"50","name":"Advanced Computer Security","credit":"Credit: 4 hours.","description":"Current research trends in computer and network security. Privacy, tamper-resistance, unwanted traffic, monitoring and surveillance, and critical infrastructure protection. Subtopics will vary depending upon current research trends. Students work in teams in close coordination with the course instructor to develop one of the topics in depth by carrying out background research and an exploratory project. \nSame as ECE 524. Prerequisite: CS 461 or CS 463."}, {"id":"55","identifier":"CS 571","department_id":"50","name":"Combinatorial Mathematics","credit":"Credit: 4 hours.","description":""}, {"id":"56","identifier":"CS 575","department_id":"50","name":"Methods of Combinatorics","credit":"Credit: 4 hours.","description":""}, {"id":"57","identifier":"CS 591","department_id":"50","name":"Advanced Seminar","credit":"Credit: 0 TO 4 hours.","description":"Seminar on topics of current interest as announced in the Class Schedule. \nApproved for S\/U grading only. May be repeated in the same or separate terms if topics vary. Prerequisite: As specified for each topic offering, see Class Schedule or departmental course description."}, {"id":"58","identifier":"CS 597","department_id":"50","name":"Individual Study","credit":"Credit: 2 TO 16 hours.","description":"Individual study or reading in a subject not covered in normal course offerings. \nMay be repeated. Prerequisite: Consent of instructor."}, {"id":"59","identifier":"CS 598","department_id":"50","name":"Special Topics","credit":"Credit: 2 TO 4 hours.","description":"Subject offerings of new and developing areas of knowledge in computer science intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}, {"id":"60","identifier":"CS 599","department_id":"50","name":"Thesis Research","credit":"Credit: 0 TO 16 hours.","description":""}, {"id":"61","identifier":"CS 102","department_id":"50","name":"Little Bits to Big Ideas","credit":"Credit: 4 hours.","description":""}, {"id":"62","identifier":"CS 410","department_id":"50","name":"Text Information Systems","credit":"Credit: 3 OR 4 hours.","description":"Theory, design, and implementation of text-based information systems. Text analysis, retrieval models (e.g., Boolean, vector space, probabilistic), text categorization, text filtering, clustering, retrieval system design and implementation, and applications to web information management. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"63","identifier":"CS 419","department_id":"50","name":"Production Computer Graphics","credit":"Credit: 3 OR 4 hours.","description":"Advanced methods for representing, displaying, and rendering two-, three-, and four-dimensional scenes. General algebraic curves and surfaces, splines, Gaussian and bump-function representation, fractals, particle systems, constructive solid geometry methods, lighting models, radiosity, advanced ray-tracing methods, surface texturing animation techniques, data visualization methods. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 418."}, {"id":"64","identifier":"CS 422","department_id":"50","name":"Programming Language Design","credit":"Credit: 3 OR 4 hours.","description":"Exploration of major language design paradigms using imperative and functional programming as unifying themes. Tools include both practical language processor construction and theoretical models. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 421."}, {"id":"65","identifier":"CS 423","department_id":"50","name":"Operating Systems Design","credit":"Credit: 3 OR 4 hours.","description":"Organization and structure of modern operating systems and concurrent programming concepts. Deadlock, virtual memory, processor scheduling, and disk systems. Performance, security, and protection. \nSame as CSE 423. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241 or ECE 391."}, {"id":"66","identifier":"CS 428","department_id":"50","name":"Software Engineering II","credit":"Credit: 3 OR 4 hours.","description":"Continuation of CS 427. Software development, management, and maintenance. Project and configuration management, collaborative development models, software quality assurance, interoperability domain engineering and software reuse, and software re-engineering. \nSame as CSE 429. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 427."}, {"id":"67","identifier":"CS 429","department_id":"50","name":"Software Engineering II, ACP","credit":"Credit: 3 hours.","description":"Continuation of CS 427. Identical to CS 428 except for the additional writing component. See CS 428. \n3 undergraduate hours. 3 graduate hours. Prerequisite: CS 427."}, {"id":"68","identifier":"CS 460","department_id":"50","name":"Security Laboratory","credit":"Credit: 3 or 4 hours.","description":"Operating systems security: access control, least privilege mechanism and malware techniques. Network security: firewalls, sniffing, tunnels, intrusion detection, AAA and worm structure. System security: forensics security architectures, and attack\/defend exercises. Complements CS 461 via hands-on project. \nSame as ECE 419. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 461."}, {"id":"69","identifier":"CS 463","department_id":"50","name":"Computer Security II","credit":"Credit: 3 OR 4 hours.","description":"Program security, trusted base, privacy, anonymity, non-interference, information flow, confinement, advanced auditing, forensics, intrusion detection, key management and distribution, policy composition and analysis, formal approaches to specification and verification of secure systems and protocols, and topics in applied cryptography. \nSame as ECE 424. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 461. Recommended: CS 475."}, {"id":"70","identifier":"CS 467","department_id":"50","name":"Social Visualization","credit":"Credit: 3 OR 4 hours.","description":"Visualizing social interaction in networked spaces: investigation of patterns in networked communications systems such as messaging (email, instant messaging), social networking sites and collaborative sites; social network theory and visualizations; exploration of how to move beyond existing visualization techniques; visualizing the network identity over compilations of online data. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 225."}, {"id":"71","identifier":"CS 468","department_id":"50","name":"Tech and Advertising Campaigns","credit":"Credit: 3 hours.","description":""}, {"id":"72","identifier":"CS 482","department_id":"50","name":"Simulation","credit":"Credit: 3 or 4 hours.","description":""}, {"id":"73","identifier":"CS 484","department_id":"50","name":"Parallel Programming","credit":"Credit: 3 OR 4 hours.","description":"Techniques for the programming of all classes of parallel computers and devices including shared memory and distributed memory multiprocessors, SIMD processors and co-processors, and special purpose devices. Key concepts in parallel programming such as reactive and transformational programming, speculation, speedup, isoefficiency, and load balancing. Synchronization primitives, libraries and languages for parallel programming such as OpenMP and MPI, performance monitoring, program tuning, analysis and programming of numerical and symbolic parallel algorithms. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: CS 241."}, {"id":"74","identifier":"CS 493","department_id":"50","name":"Senior Project II, ACP","credit":"Credit: 3 hours.","description":"Continuation of CS 492. Identical to CS 494 except for an additional writing component. See CS 494. \n3 undergraduate hours. No graduate credit. Credit is not given for both CS 493 and a project course in another engineering department for the same project. Prerequisite: CS 492."}, {"id":"75","identifier":"CS 494","department_id":"50","name":"Senior Project II","credit":"Credit: 3 hours.","description":"Continuation of CS 492. \n3 undergraduate hours. No graduate credit. Credit is not given for both CS 494 and a project course in another engineering department for the same project. Prerequisite: CS 492."}, {"id":"76","identifier":"CS 511","department_id":"50","name":"Advanced Data Management","credit":"Credit: 4 hours.","description":"Advanced concepts in data management and information system design and implementation, and recent developments in the field. 1) Relational roots, objects and extensibility, query languages, data indexing, query processing, transaction processing, benchmarks, and 2) semi-structured data and unstructured data, information extraction, information integration, web search and mining, and other emerging directions in the field. \nPrerequisite: CS 411."}, {"id":"77","identifier":"CS 512","department_id":"50","name":"Data Mining Principles","credit":"Credit: 4 hours.","description":"An advanced course on principles and algorithms of data mining. Data cleaning and integration; descriptive and predictive mining; mining frequent, sequential, and structured patterns; clustering, outlier analysis and fraud detection; stream data, web, text, and biomedical data mining; security and privacy in data mining; research frontiers. \nPrerequisite: CS 412."}, {"id":"78","identifier":"CS 522","department_id":"50","name":"Programming Language Semantics","credit":"Credit: 4 hours.","description":"Theory of programming languages including functional programming, meta-circular interpreters, typed, untyped and polymorphic lambda-calculi, and denotational semantics. \nPrerequisite: CS 422 and CS 426."}, {"id":"79","identifier":"CS 524","department_id":"50","name":"Concurrent Progrmg Languages","credit":"Credit: 4 hours.","description":"Theory of concurrency and concurrent programming languages. Formal models of concurrent computation such as process algebras, nets, and actors; high level concurrent programming languages and their operational semantics; methods for reasoning about correctness and complexity of concurrent programs. \nPrerequisite: CS 422; CS 475 or CS 476."}, {"id":"80","identifier":"CS 525","department_id":"50","name":"Advanced Distributed Systems","credit":"Credit: 4 hours.","description":"Peer-to-peer systems, sensor networks, and fundamental theoretical distributed computing. Review of classical work in each area, and application of design methodologies to explore overlaps across them. Emphasis on protocol design, systems issues, and theory. Reading selections are roughly two-third classical to one-third contemporary. Students write critiques, make presentations, and create a conference paper in a systematic manner. \nPrerequisite: One of CS 423, CS 425, CS 438."}, {"id":"81","identifier":"CS 526","department_id":"50","name":"Advanced Compiler Construction","credit":"Credit: 4 hours.","description":"Incremental and interactive compiling, error correction, code optimization, models of code generators. \nPrerequisite: CS 426."}, {"id":"82","identifier":"CS 533","department_id":"50","name":"Parallel Computer Architecture","credit":"Credit: 4 hours.","description":"Theoretical aspects of parallel and pipeline computation; time and processor bounds on classes of computations; data alignment network speed and cost bounds; conflict-free access memories; overall computer system ideas. \nSame as CSE 522. Prerequisite: CS 433."}, {"id":"83","identifier":"CS 536","department_id":"50","name":"Fault-Tolerant Dig Syst Design","credit":"Credit: 4 hours.","description":""}, {"id":"84","identifier":"CS 538","department_id":"50","name":"Advanced Computer Networks","credit":"Credit: 4 hours.","description":"Advanced concepts in computer networks, including congestion control, quality of service, naming, routing, wireless networks, Internet architecture, measurement, network security, and selected recent research directions. \nPrerequisite: CS 438."}, {"id":"85","identifier":"CS 543","department_id":"50","name":"Computer Vision","credit":"Credit: 4 hours.","description":""}, {"id":"86","identifier":"CS 546","department_id":"50","name":"Machine Learning in NLP","credit":"Credit: 4 hours.","description":"Central learning frameworks and techniques that have emerged in the field of natural language processing and found applications in several areas in text and speech processing: from information retrieval and extraction, through speech recognition to syntax, semantics and language understanding related tasks. Examination of the theoretical paradigms -- learning theoretic, probabilistic, and information theoretic -- and the relations among them, as well as the main algorithmic techniques developed within each paradigm and in key natural language applications. \nPrerequisite: CS 446 and CS 473."}, {"id":"87","identifier":"CS 555","department_id":"50","name":"Numerical Methods for PDEs","credit":"Credit: 4 hours.","description":"Numerical techniques for initial and boundary value problems in partial differential equations. Finite difference and finite element discretization techniques, direct and iterative solution methods for discrete problems, and programming techniques and usage of software packages. \nSame as CSE 510. Prerequisite: CS 450 or CS 457."}, {"id":"88","identifier":"CS 579","department_id":"50","name":"Computational Complexity","credit":"Credit: 4 hours.","description":"Turing machines; determinism and non-determinism; time and space hierarchy theorems; speed-up and tape compression; Blum axioms; structure of complexity classes NP, P, NL, L, and PSPACE; complete problems; randomness and complexity classes RP, RL, and BPP; alternation, polynomial-time hierarchy; circuit complexity, parallel complexity, NC, and RNC; relativized computational complexity; time-space trade-offs. \nSame as ECE 579. Prerequisite: CS 473 or CS 475."}, {"id":"89","identifier":"CS 583","department_id":"50","name":"Approximation Algorithms","credit":"Credit: 4 hours.","description":"Approximation algorithms for NP-hard problems. Basic and advanced techniques in approximation algorithm design: combinatorial algorithms; mathematical programming methods including linear and semi-definite programming, local search methods, and others. Algorithms for graphs and networks, constraint satisfaction, packing and scheduling. \nPrerequisite: CS 573 or consent of instructor."}, {"id":"90","identifier":"CS 584","department_id":"50","name":"Embedded System Verification","credit":"Credit: 4 hours.","description":""}, {"id":"91","identifier":"MATH 103","department_id":"118","name":"Theory of Arithmetic","credit":"Credit: 4 hours.","description":"Analyses of the mathematical issues and methodology underlying elementary mathematics in grades K-5. Topics include sets, arithmetic algorithms, elementary number theory, rational and irrational numbers, measurement, and probability. There is an emphasis on problem solving. Priority registration will be given to students enrolled in teacher education programs leading to certification in elementary or childhood education. \nPrerequisite: MATH 112 (formerly MATH 012) or equivalent."}, {"id":"92","identifier":"MATH 112","department_id":"118","name":"Algebra","credit":"Credit: 3 hours.","description":"Rapid review of basic techniques of factoring, rational expressions, equations and inequalities; functions and graphs; exponential and logarithm functions; systems of equations; matrices and determinants; polynomials; and the binomial theorem. \nPrerequisite: 1.5 units of high school algebra; 1 unit of high school geometry."}, {"id":"93","identifier":"MATH 115","department_id":"118","name":"Preparation for Calculus","credit":"Credit: 3 hours.","description":"Reviews trigonometric, rational, exponential, and logarithmic functions; provides a full treatment of limits, definition of derivative, and an introduction to finding area under a curve. Intended for students who need preparation for MATH 220, either because they lack the content background or because they are not prepared for the rigor of a university calculus course. \nCredit is not given for both MATH 115 and either MATH 014 or MATH 114. Credit is not given for MATH 115 if credit for either MATH 220 or MATH 221 has been earned. Prerequisite: An adequate ALEKS placement score as described at http:\/\/math.illinois.edu\/ALEKS\/, demonstrating knowledge of the topics of MATH 112."}, {"id":"94","identifier":"MATH 117","department_id":"118","name":"Elementary Mathematics","credit":"Credit: 4 hours.","description":"Analyses of the mathematical issues and methodology underlying elementary mathematics in grades 6-8. Topics include the Real number system and field axioms, sequences and series, functions and math modeling with technology, Euclidean and non-Euclidean geometry, probability and statistics. \nPriority registration will be given to students enrolled in teacher education programs leading to certification in elementary education. Prerequisite: MATH 112 (formerly MATH 012) or equivalent."}, {"id":"95","identifier":"MATH 119","department_id":"118","name":"Ideas in Geometry","credit":"Credit: 3 hours.","description":"General education course in mathematics, for students who do not have mathematics as a central part of their studies. The goal is to convey the spirit of mathematical thinking through topics chosen mainly from plane geometry. \nPrerequisite: Two units of high school algebra; one unit of high school geometry; or equivalent."}, {"id":"96","identifier":"MATH 124","department_id":"118","name":"Finite Mathematics","credit":"Credit: 3 hours.","description":"Introduction to finite mathematics for students in the social sciences; introduces the student to the basic ideas of logic, set theory, probability, vectors and matrices, and Markov chains. Problems are selected from social sciences and business. \nPrerequisite: MATH 112 (formerly MATH 012) or an adequate ALEKS score."}, {"id":"97","identifier":"MATH 181","department_id":"118","name":"A Mathematical World","credit":"Credit: 3 hours.","description":"Introduction to selected areas of mathematical sciences through application to modeling and solution of problems involving networks, circuits, trees, linear programming, random samples, regression, probability, inference, voting systems, game theory, symmetry and tilings, geometric growth, comparison of algorithms, codes and data management. \nPrerequisite: Three years of high school mathematics, including two years of algebra and one year of geometry."}, {"id":"98","identifier":"MATH 199","department_id":"118","name":"Undergraduate Open Seminar","credit":"Credit: 1 TO 5 hours.","description":""}, {"id":"99","identifier":"MATH 210","department_id":"118","name":"Theory of Interest","credit":"Credit: 3 hours.","description":"Study of compound interest and annuities; applications to problems in finance. \nPrerequisite: MATH 231 or equivalent."}, {"id":"100","identifier":"MATH 213","department_id":"118","name":"Basic Discrete Mathematics","credit":"Credit: 3 hours.","description":"Beginning course on discrete mathematics, including sets and relations, functions, basic counting techniques, recurrence relations, graphs and trees, and matrix algebra; emphasis throughout is on algorithms and their efficacy. \nCredit is not given for both MATH 213 and CS 173. Prerequisite: MATH 220 or MATH 221, or equivalent."}, {"id":"101","identifier":"MATH 220","department_id":"118","name":"Calculus","credit":"Credit: 5 hours.","description":"First course in calculus and analytic geometry; basic techniques of differentiation and integration with applications including curve sketching; antidifferentation, the Riemann integral, fundamental theorem, exponential and trigonometric functions. \nCredit is not given for both MATH 220 and either MATH 221 or MATH 234. Prerequisite: An adequate ALEKS placement score as described at http:\/\/math.illinois.edu\/ALEKS\/, demonstrating knowledge of topics of MATH 115. Students with previous calculus experience should consider MATH 221."}, {"id":"102","identifier":"MATH 225","department_id":"118","name":"Introductory Matrix Theory","credit":"Credit: 2 hours.","description":"Systems of linear equations, matrices and inverses, determinants, and a glimpse at vector spaces, eigenvalues and eigenvectors. \nCredit is not given for both MATH 225 and any of MATH 125, MATH 410, or MATH 415. Prerequisite: MATH 220 or MATH 221; or equivalent."}, {"id":"103","identifier":"MATH 231","department_id":"118","name":"Calculus II","credit":"Credit: 3 hours.","description":"Second course in calculus and analytic geometry: techniques of integration, conic sections, polar coordinates, and infinite series. \nPrerequisite: MATH 220 or MATH 221."}, {"id":"104","identifier":"MATH 234","department_id":"118","name":"Calculus for Business I","credit":"Credit: 4 hours.","description":"Introduction to the concept of functions and the basic ideas of the calculus. \nCredit is not given for both MATH 234 and either MATH 220 or MATH 221. Prerequisite: An adequate ALEKS placement score as described at http:\/\/math.illinois.edu\/ALEKS\/, demonstrating knowledge of the topics of MATH 112."}, {"id":"105","identifier":"MATH 241","department_id":"118","name":"Calculus III","credit":"Credit: 4 hours.","description":"Third course in calculus and analytic geometry including vector analysis: Euclidean space, partial differentiation, multiple integrals, line integrals and surface integrals, the integral theorems of vector calculus. \nCredit is not given for both MATH 241 and MATH 292. Prerequisite: MATH 231."}, {"id":"106","identifier":"MATH 249","department_id":"118","name":"Honors Supplement","credit":"Credit: 1 hours.","description":"Supplemental credit hour for honors courses with additional material or special projects. \nPrerequisite: Concurrent registration in a specially designated honors section and consent of department."}, {"id":"107","identifier":"MATH 285","department_id":"118","name":"Intro Differential Equations","credit":"Credit: 3 hours.","description":"Techniques and applications of ordinary differential equations, including Fourier series and boundary value problems, and an introduction to partial differential equations. Intended for engineering majors and others who require a working knowledge of differential equations. \nCredit is not given for both MATH 285 and any of MATH 284, MATH 286, MATH 441. Prerequisite: MATH 241."}, {"id":"108","identifier":"MATH 286","department_id":"118","name":"Intro to Differential Eq Plus","credit":"Credit: 4 hours.","description":"Techniques and applications of ordinary differential equations, including Fourier series and boundary value problems, linear systems of differential equations, and an introduction to partial differential equations. Covers all the MATH 285 plus linear systems. Intended for engineering majors and other who require a working knowledge of differential equations. \nCredit is not given for both MATH 286 and any of MATH 284, MATH 285, MATH 441. Prerequisite: MATH 241."}, {"id":"109","identifier":"MATH 347","department_id":"118","name":"Fundamental Mathematics","credit":"Credit: 3 hours.","description":"Fundamental ideas used in many areas of mathematics. Topics will include: techniques of proof, mathematical induction, binomial coefficients, rational and irrational numbers, the least upper bound axiom for real numbers, and a rigorous treatment of convergence of sequences and series. This will be supplemented by the instructor from topics available in the various texts. Students will regularly write proofs emphasizing precise reasoning and clear exposition. \nCredit is not given for both MATH 347 and MATH 348. Prerequisite: MATH 231."}, {"id":"110","identifier":"MATH 348","department_id":"118","name":"Fundamental Mathematics-ACP","credit":"Credit: 4 hours.","description":"Course is identical to MATH 347 except for the additional writing component. \nCredit is not given for both MATH 348 and MATH 347. Prerequisite: MATH 231 and completion of the campus Composition I general education requirement."}, {"id":"111","identifier":"MATH 357","department_id":"118","name":"Numerical Methods I","credit":"Credit: 3 hours.","description":""}, {"id":"112","identifier":"MATH 362","department_id":"118","name":"Probability with Engrg Applic","credit":"Credit: 3 hours.","description":""}, {"id":"113","identifier":"MATH 370","department_id":"118","name":"Actuarial Problem Solving","credit":"Credit: 1 hours.","description":"Methods and techniques of solving problems in actuarial mathematics for advanced students intending to enter the actuarial profession. \nApproved for S\/U grading only. May be repeated in the same or separate terms to a maximum of 4 hours. Prerequisite: Consent of instructor."}, {"id":"114","identifier":"MATH 390","department_id":"118","name":"Individual Study","credit":"Credit: 0 TO 3 hours.","description":"Guided individual study of advanced topics not covered in other courses. \nMay be repeated to a maximum of 8 hours. Approved for both letter and S\/U grading. Prerequisite: Consent of instructor."}, {"id":"115","identifier":"MATH 399","department_id":"118","name":"Math\/Actuarial Internship","credit":"Credit: 0 hours.","description":"Full-time or part-time practice of math or actuarial science in an off-campus government, industrial, or research laboratory environment. Summary report required. \nApproved for S\/U grading only. May be repeated in separate terms. Prerequisite: After obtaining an internship, Mathematics majors must request entry from the Mathematics Director of Undergraduate Studies; Actuarial Science majors must request entry from the Director of the Actuarial Science Program."}, {"id":"116","identifier":"MATH 402","department_id":"118","name":"Non Euclidean Geometry","credit":"Credit: 3 OR 4 hours.","description":"Historical development of geometry; includes tacit assumptions made by Euclid; the discovery of non-Euclidean geometries; geometry as a mathematical structure; and an axiomatic development of plane geometry. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241; MATH 347 or MATH 348, or equivalent; or consent of instructor."}, {"id":"117","identifier":"MATH 403","department_id":"118","name":"Euclidean Geometry","credit":"Credit: 3 OR 4 hours.","description":"Selected topics from geometry, including the nine-point circle, theorems of Cera and Menelaus, regular figures, isometries in the plane, ordered and affine geometries, and the inversive plane. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241; MATH 347 or 348, or equivalent; or consent of instructor."}, {"id":"118","identifier":"MATH 405","department_id":"118","name":"Teacher's Course","credit":"Credit: 3 OR 4 hours.","description":"In-depth, advanced perspective look at selected topics covered in the secondary curriculum.  Connects mathematics learned at the university level to content introduced at the secondary level. Intended for students who plan to seek a secondary certificate in mathematics teaching. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241; MATH 347 or MATH 348, or equivalent; or consent of instructor."}, {"id":"119","identifier":"MATH 408","department_id":"118","name":"Actuarial Statistics I","credit":"Credit: 4 hours.","description":""}, {"id":"120","identifier":"MATH 410","department_id":"118","name":"Lin Algebra & Financial Apps","credit":"Credit: 3 OR 4 hours.","description":"Emphasizes techniques of linear algebra and introductory and advanced applications to actuarial science, finance and economics. Topics include linear equations, matrix theory, vector spaces, linear transformations, eigenvalues and eigenvectors and inner product spaces. In addition, current research topics such as modeling, data mining, and generalized linear models are explored. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 410 and any of MATH 125, MATH 225, MATH 415 or MATH 416. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241; MATH 210 or FIN 221; or consent of instructor."}, {"id":"121","identifier":"MATH 412","department_id":"118","name":"Graph Theory","credit":"Credit: 3 OR 4 hours.","description":"Examines basic concepts and applications of graph theory, where graph refers to a set of vertices and edges that join some pairs of vertices; topics include subgraphs, connectivity, trees, cycles, vertex and edge coloring, planar graphs and their colorings. Draws applications from computer science, operations research, chemistry, the social sciences, and other branches of mathematics, but emphasis is placed on theoretical aspects of graphs. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 347 or MATH 348 or equivalent experience or CS 373."}, {"id":"122","identifier":"MATH 413","department_id":"118","name":"Intro to Combinatorics","credit":"Credit: 3 OR 4 hours.","description":"Permutations and combinations, generating functions, recurrence relations, inclusion and exclusion, Polya's theory of counting, and block designs. \nSame as CS 413. 3 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. Prerequisite: MATH 347 or MATH 348 or equivalent experience."}, {"id":"123","identifier":"MATH 414","department_id":"118","name":"Mathematical Logic","credit":"Credit: 3 OR 4 hours.","description":"Introduction to the formalization of mathematics and the study of axiomatic systems; expressive power of logical formulas; detailed treatment of propositional logical and predicate logic; compactness theorem and Godel completeness theorem, with applications to specific mathematical theories; algorithmic aspects of logical formulas. Proofs are emphasized in this course, which can serve as an introduction to abstract mathematics and rigorous proof; some ability to do mathematical reasoning required. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 347 or MATH 348 or equivalent experience."}, {"id":"124","identifier":"MATH 415","department_id":"118","name":"Applied Linear Algebra","credit":"Credit: 3 or 4 hours.","description":"Introductory course emphasizing techniques of linear algebra with applications to engineering; topics include matrix operations, determinants, linear equations, vector spaces, linear transformations, eigenvalues, and eigenvectors, inner products and norms, orthogonality, equilibrium, and linear dynamical systems. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 415 and any of MATH 125, MATH 225, MATH 410, or MATH 416. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 or consent of instructor."}, {"id":"125","identifier":"MATH 416","department_id":"118","name":"Abstract Linear Algebra","credit":"Credit: 3 OR 4 hours.","description":"Rigorous proof-oriented course in linear algebra. Topics include determinants, vector spaces over fields, linear transformations, inner product spaces, eigenvectors and eigenvalues, Hermitian matrices, Jordan Normal Form. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 416 and either MATH 410 or MATH 415. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 or consent of instructor; MATH 347 is recommended."}, {"id":"126","identifier":"MATH 417","department_id":"118","name":"Intro to Abstract Algebra","credit":"Credit: 3 OR 4 hours.","description":"Fundamental theorem of arithmetic, congruences. Permutations. Groups and subgroups, homomorphisms. Group actions with applications. Polynomials. Rings, subrings, and ideals. Integral domains and fields. Roots of polynomials. Maximal ideals, construction of fields. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: Either MATH 416 or one of MATH 410, MATH 415 together with one of MATH 347, MATH 348, CS 373; or consent of instructor."}, {"id":"127","identifier":"MATH 418","department_id":"118","name":"Intro to Abstract Algebra II","credit":"Credit: 3 OR 4 hours.","description":"Rings of quotients of an integral domain. Euclidean domains, principal ideal domains. Unique factorization in polynomial rings. Fields extensions, ruler and compass constructions. Finite fields with applications. Modules. Structure theorem for finitely generated modules over principal ideal domains. Application to finitely generated abelian groups and canonical forms of matrices. Introduction to error-correcting codes. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 417 or consent of instructor."}, {"id":"128","identifier":"MATH 425","department_id":"118","name":"Honors Advanced Analysis","credit":"Credit: 3 hours.","description":"A theoretical treatment of differential and integral calculus in higher dimensions. Topics include inverse and implicit function theorems, submanifolds, the theorems of Green, Gauss and Stokes, differential forms, and applications. As part of the honors sequence, this course will be rigorous and abstract. \n3 undergraduate hours. No graduate credit. Approved for honors grading. Prerequisite: MATH 424 and either MATH 415 or MATH 416, and consent of the department."}, {"id":"129","identifier":"MATH 428","department_id":"118","name":"Honors Topics in Mathematics","credit":"Credit: 3 hours.","description":"A capstone course in the Mathematics Honors Sequences. Topics will vary. As part of the honors sequence, this course will be rigorous and abstract. \n3 undergraduate hours. No graduate credit. May be repeated in the same or separate terms to a maximum of 12 hours. Prerequisite: Consent of the department."}, {"id":"130","identifier":"MATH 432","department_id":"118","name":"Set Theory and Topology","credit":"Credit: 3 OR 4 hours.","description":"Informal set theory, cardinal and ordinal numbers, and the axiom of choice; topology of metric spaces and introduction to general topological spaces. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 347 or MATH 348 or consent of instructor."}, {"id":"131","identifier":"MATH 441","department_id":"118","name":"Differential Equations","credit":"Credit: 3 OR 4 hours.","description":"Basic course in ordinary differential equations; topics include existence and uniqueness of solutions and the general theory of linear differential equations; treatment is more rigorous than that given in MATH 285. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 441 and any of MATH 284, MATH 285, MATH 286. 4 hours of credit requires approval of the instructor and completion of additional work of substance. Prerequisite: MATH 241; MATH 347 or MATH 348 is recommended."}, {"id":"132","identifier":"MATH 442","department_id":"118","name":"Intro Partial Diff Equations","credit":"Credit: 3 OR 4 hours.","description":"Introduces partial differential equations, emphasizing the wave, diffusion and potential (Laplace) equations. Focuses on understanding the physical meaning and mathematical properties of solutions of partial differential equations. Includes fundamental solutions and transform methods for problems on the line, as well as separation of variables using orthogonal series for problems in regions with boundary. Covers convergence of Fourier series in detail. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. Prerequisite: One of MATH 284, MATH 285, MATH 286, MATH 441."}, {"id":"133","identifier":"MATH 444","department_id":"118","name":"Elementary Real Analysis","credit":"Credit: 3 OR 4 hours.","description":"Careful treatment of the theoretical aspects of the calculus of functions of a real variable intended for those who do not plan to take graduate courses in Mathematics. Topics include the real number system, limits, continuity, derivatives, and the Riemann integral. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 444 and either Math 424 or MATH 447. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241; MATH 347 or MATH 348, or equivalent."}, {"id":"134","identifier":"MATH 446","department_id":"118","name":"Applied Complex Variables","credit":"Credit: 3 OR 4 hours.","description":"For students who desire a working knowledge of complex variables; covers the standard topics and gives an introduction to integration by residues, the argument principle, conformal maps, and potential fields. Students desiring a systematic development of the foundations of the subject should take MATH 448. \n3 or 4 undergraduate hours. 3 or 4 graduate hours.  Credit is not given for both MATH 446 and MATH 448. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241."}, {"id":"135","identifier":"MATH 447","department_id":"118","name":"Real Variables","credit":"Credit: 3 OR 4 hours.","description":"Careful development of elementary real analysis including such topics as completeness property of the real number system; basic topological properties of n-dimensional space; convergence of numerical sequences and series of functions; properties of continuous functions; and basic theorems concerning differentiation and Riemann integration. \n3 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 447 and MATH 444. 4 hours of credit requires approval of the instructor and completion of additional work of substance. Prerequisite: MATH 241 or equivalent; junior standing; MATH 347 or MATH 348, or equivalent experience; or consent of instructor."}, {"id":"136","identifier":"MATH 448","department_id":"118","name":"Complex Variables","credit":"Credit: 3 OR 4 hours.","description":"For students who desire a rigorous introduction to the theory of functions of a complex variable; topics include Cauchy's theorem, the residue theorem, the maximum modulus theorem, Laurent series, the fundamental theorem of algebra, and the argument principle. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 448 and MATH 446. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 447."}, {"id":"137","identifier":"MATH 450","department_id":"118","name":"Numerical Analysis","credit":"Credit: 0 to 4 hours.","description":""}, {"id":"138","identifier":"MATH 453","department_id":"118","name":"Elementary Theory of Numbers","credit":"Credit: 3 OR 4 hours.","description":"Basic introduction to the theory of numbers. Core topics include divisibility, primes and factorization, congruences, arithmetic functions, quadratic residues and quadratic reciprocity, primitive roots and orders. Additional topics covered at the discretion of the instructor include sums of squares, Diophantine equations, continued fractions, Farey fractions, recurrences, and applications to primality testing and cryptopgraphy. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 or equivalent."}, {"id":"139","identifier":"MATH 461","department_id":"118","name":"Probability Theory","credit":"Credit: 3 OR 4 hours.","description":"Introduction to mathematical probability; includes the calculus of probability, combinatorial analysis, random variables, expectation, distribution functions, moment-generating functions, and central limit theorem. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. Credit is not given for both MATH 461 and either MATH 408 or ECE 313. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 or equivalent."}, {"id":"140","identifier":"MATH 463","department_id":"118","name":"Statistics and Probability I","credit":"Credit: 4 hours.","description":""}, {"id":"141","identifier":"MATH 464","department_id":"118","name":"Statistics and Probability II","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"142","identifier":"MATH 469","department_id":"118","name":"Methods of Applied Statistics","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"143","identifier":"MATH 472","department_id":"118","name":"Actuarial Theory II","credit":"Credit: 3 OR 4 hours.","description":"Continuation of MATH 471. Emphasis is on multiple-life functions. \n3 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. Prerequisite: MATH 471."}, {"id":"144","identifier":"MATH 478","department_id":"118","name":"Actuarial Modeling","credit":"Credit: 3 OR 4 hours.","description":"Considers the specification and evaluation of various types of actuarial models. Examines severity, frequency, and compound distributions useful in modeling the insurance loss process. Credibility theory is also discussed. \n3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: MATH 408, MATH 461 or MATH 463; credit or concurrent registration in MATH 409 or MATH 464."}, {"id":"145","identifier":"MATH 481","department_id":"118","name":"Vector and Tensor Analysis","credit":"Credit: 3 OR 4 hours.","description":"Introductory course in modern differential geometry focusing on examples, broadly aimed at students in mathematics, the sciences, and engineering. Emphasis on rigorously presented concepts, tools and ideas rather than on proofs. The topics covered include differentiable manifolds, tangent spaces and orientability; vector and tensor fields; differential forms; integration on manifolds and Generalized Stokes Theorem; Riemannian metrics, Riemannian connections and geodesics. Applications to configuration and phase spaces, Maxwell equations and relativity theory will be discussed. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241 and one of MATH 415 or MATH 416 or equivalent."}, {"id":"146","identifier":"MATH 482","department_id":"118","name":"Linear Programming","credit":"Credit: 3 OR 4 hours.","description":"Rigorous introduction to a wide range of topics in optimization, including a thorough treatment of basic ideas of linear programming, with additional topics drawn from numerical considerations, linear complementarity, integer programming and networks, polyhedral methods. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 410, MATH 415, or MATH 416."}, {"id":"147","identifier":"MATH 484","department_id":"118","name":"Nonlinear Programming","credit":"Credit: 3 OR 4 hours.","description":"Iterative and analytical solutions of constrained and unconstrained problems of optimization; gradient and conjugate gradient solution methods; Newton's method, Lagrange multipliers, duality and the Kuhn-Tucker theorem; and quadratic, convex, and geometric programming. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and department with completion of additional work of substance. Prerequisite: MATH 241; MATH 347 or MATH 348; or equivalent; MATH 415 or equivalent; or consent of instructor."}, {"id":"148","identifier":"MATH 487","department_id":"118","name":"Advanced Engineering Math","credit":"Credit: 3 OR 4 hours.","description":"Complex linear algebra, inner product spaces, Fourier transforms and analysis of boundary value problems, Sturm-Liouville theory. \nSame as ECE 493. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: One of MATH 284, MATH 285, MATH 286, MATH 441."}, {"id":"149","identifier":"MATH 489","department_id":"118","name":"Dynamics & Differential Eqns","credit":"Credit: 3 OR 4 hours.","description":"Studies mathematical theory of dynamical systems, emphasizing both discrete-time dynamics and nonlinear systems of differential equations. Topics include: chaos, fractals, attractors, bifurcations, with application to areas such as population biology, fluid dynamics and classical physics. Basic knowledge of matrix theory will be assumed. \n3 or 4 undergraduate hours. 3 or 4 graduate hours. 4 hours of credit requires approval of the instructor and completion of additional work of substance. Prerequisite: One of MATH 284, MATH 285, MATH 286, MATH 441."}, {"id":"150","identifier":"MATH 490","department_id":"118","name":"Advanced Topics in Mathematics","credit":"Credit: 1 TO 4 hours.","description":"Deals with selected topics and applications of mathematics; see Class Schedule or department office for current topics. \n1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated with approval. Prerequisite: Consent of instructor."}, {"id":"151","identifier":"MATH 492","department_id":"118","name":"Undergraduate Research in Math","credit":"Credit: 1 TO 3 hours.","description":"Work closely with department faculty on a well-defined research project. Topics and nature of assistance vary. Capstone paper or computational project required. \n1 to 3 undergraduate hours. No graduate credit. May be repeated in separate terms up to 8 hours. Prerequisite: Evidence of adequate preparation for such study; consent of faculty member supervising the work; and approval of the department head."}, {"id":"152","identifier":"MATH 496","department_id":"118","name":"Honors Seminar","credit":"Credit: 3 hours.","description":"Careful study of a selected area of mathematics, carried out either deductively from axioms or inductively through problems; subject matter varies with instructor. \n3 undergraduate hours. No graduate credit. May be repeated to a maximum of 6 hours. Prerequisite: Consent of Mathematics Honors Committee."}, {"id":"153","identifier":"MATH 499","department_id":"118","name":"Introduction Graduate Research","credit":"Credit: 1 hours.","description":"Seminar is required of all first-year graduate students in Mathematics. It provides a general introduction to the courses and research work in all of the areas of mathematics that are represented at the University of Illinois at Urbana-Champaign. \n1 undergraduate hour. 1 graduate hour. Approved for S\/U grading only. May be repeated to a maximum of 2 hours. Prerequisite: Graduate standing or consent of instructor."}, {"id":"154","identifier":"MATH 503","department_id":"118","name":"Intro Geometric Group Theory","credit":"Credit: 4 hours.","description":"Free groups, groups given by generators and relations, van Kampen diagrams. Free product with amalgamations and HNN-extensions, Bass-Serre theory. Solvable and nilpotent groups. Quasi-isometries and geometric properties of groups. \nPrerequisite: MATH 500 or equivalent."}, {"id":"155","identifier":"MATH 505","department_id":"118","name":"Homological Algebra","credit":"Credit: 4 hours.","description":"Topics include: 1. Snake lemma, homology, long exact sequence in homology; 2. Projective and injective modules and resolutions; 3. Categories, functors and derived functors. Tor and Ext, local cohomology; 4. Group cohomology, bar resolution; 5. Spectral sequences, techniques of computation, Serre spectral sequence. Grothendieck spectral sequence of composite functors; 6. Time permitting: Derived categories, Gysin sequence, Kunneth formula, universal coefficient theorm, Eilenberg-Moore sequence. \nPrerequisite: MATH 501 or equivalent."}, {"id":"156","identifier":"MATH 510","department_id":"118","name":"Riemann Surf & Algebraic Curv","credit":"Credit: 4 hours.","description":"An introduction to Riemann Surfaces from both the algebraic and function-theoretic points of view. Topics include holomorphic and meromorphic differential forms, integration of differential forms, divisors and linear equivalence, the genus of a compact Riemann surface, projective algebraic curves, the Riemann-Roch theorem, and applications. \nPrerequisite: MATH 542."}, {"id":"157","identifier":"MATH 511","department_id":"118","name":"Intro to Algebraic Geometry","credit":"Credit: 4 hours.","description":"An introduction to the study of algebraic sets defined by polynomial equations; affine and projective space and their subvarieties; rational and regular functions and mappings; divisors, linear systems, and projective embeddings; birational geometry, blowing up; Grassmannians and other special varieties. \nPrerequisite: MATH 500."}, {"id":"158","identifier":"MATH 519","department_id":"118","name":"Differentiable Manifolds II","credit":"Credit: 4 hours.","description":"Vector bundles, principal bundles, connections, parallel transport, curvature, Chern-Weyl theory, Hodge-DeRham theory. Other topics may include Riemannian geometry, symplectic geometry, spin geometry, and harmonic maps. \nPrerequisite: MATH 518 or consent of instructor."}, {"id":"159","identifier":"MATH 525","department_id":"118","name":"Algebraic Topology I","credit":"Credit: 4 hours.","description":"Introduction to the study of topological spaces by means of algebraic invariants. Topics include the fundamental group, covering spaces and their classification, simplicial and singular homology, applications such as the Brouwer fixed point theorem and the Jordan curve theorem. \nPrerequisite: MATH 417 and MATH 448 or consent of instructor."}, {"id":"160","identifier":"MATH 530","department_id":"118","name":"Algebraic Number Theory","credit":"Credit: 4 hours.","description":"Further development of the theory of fields covering topics from valuation theory, ideal theory, units in algebraic number fields, ramification, function fields, and local class field theory. \nPrerequisite: MATH 500 or equivalent."}, {"id":"161","identifier":"MATH 532","department_id":"118","name":"Analytic Theory of Numbers II","credit":"Credit: 4 hours.","description":"Development of themes from MATH 531 and further topics chosen from additive number theory, asymptotic properties of multiplicative functions, circle method, diophantine approximation, lattice point problems, metric theory, modular forms, sieve theory. \nMay be repeated. Prerequisite: MATH 531."}, {"id":"162","identifier":"MATH 533","department_id":"118","name":"Fiber Spaces and Char Classes","credit":"Credit: 4 hours.","description":"Study of fiber bundles and their associated characteristic classes; applications to geometric problems. \nPrerequisite: MATH 526."}, {"id":"163","identifier":"MATH 540","department_id":"118","name":"Real Analysis","credit":"Credit: 4 hours.","description":"Lebesgue measure on the real line; integration and differentiation of real valued functions of a real variable; and additional topics at discretion of instructor. \nPrerequisite: MATH 447 or equivalent."}, {"id":"164","identifier":"MATH 541","department_id":"118","name":"Functional Analysis","credit":"Credit: 4 hours.","description":"Fundamental results in functional analysis; spectral theory of compact operators; further topics chosen by the instructor. \nPrerequisite: MATH 540."}, {"id":"165","identifier":"MATH 542","department_id":"118","name":"Complex Variables I","credit":"Credit: 4 hours.","description":"Topics include the Cauchy theory, harmonic functions, entire and meromorphic functions, and the Riemann mapping theorem. \nPrerequisite: MATH 446 and MATH 447, or MATH 448."}, {"id":"166","identifier":"MATH 547","department_id":"118","name":"Banach Spaces","credit":"Credit: 4 hours.","description":"Basic properties and fundamental theorems of Banach spaces and bounded linear maps, trace duality, absolutely summing maps, local theory, type and cotype, probabilistic techniques in Banach spaces, and further topics depending on the instructor. \n4 graduate hours. No professional credit. Prerequisite: MATH 541."}, {"id":"167","identifier":"MATH 553","department_id":"118","name":"Partial Differential Equations","credit":"Credit: 4 hours.","description":"Basic introduction to the study of partial differential equations; topics include: the Cauchy problem, power-series methods, characteristics, classification, canonical forms, well-posed problems, Riemann's method for hyperbolic equations, the Goursat problem, the wave equation, Sturm-Liouville problems and separation of variables, Fourier series, the heat equation, integral transforms, Laplace's equation, harmonic functions, potential theory, the Dirichlet and Neumann problems, and Green's functions. \nPrerequisite: Consent of instructor."}, {"id":"168","identifier":"MATH 555","department_id":"118","name":"Nonlinear Anal & Part Diff Eq","credit":"Credit: 4 hours.","description":"Course will provide students with the basic background in nonlinear analysis associated with partial differential equations. The specific topics chosen will be largely up to the instructor, but will cover such areas as existence and uniqueness techniques, nonexistence and finite time blow-up results, hyperbolic conservation laws, weak solutions, stability theory, nonlinear elliptic theory, regularity theory. \nMay be repeated as topics vary. Prerequisite: Consent of instructor."}, {"id":"169","identifier":"MATH 561","department_id":"118","name":"Theory of Probability I","credit":"Credit: 4 hours.","description":"Mathematical foundations of probability and stochastic processes; probability measures, random variables, distribution functions, convergence theory, the Central Limit Theorem, conditional expectation, and martingale theory. \nSame as STAT 551. Prerequisite: MATH 541 or consent of instructor."}, {"id":"170","identifier":"MATH 567","department_id":"118","name":"Topics in Actuarial Theory I","credit":"Credit: 4 hours.","description":"Selected topics in advanced actuarial science. \nMay be repeated to a maximum of 16 hours. Prerequisite: Consent of instructor."}, {"id":"171","identifier":"MATH 568","department_id":"118","name":"Topics in Actuarial Theory II","credit":"Credit: 4 hours.","description":"Topics in mathematical theory of actuarial science beyond basic life contingencies, such as graduation of mortality tables, survival models, mathematics of demography. See Class Schedule or department office for current topics. A paper will generally be required. \nMay be repeated to a maximum of 16 hours. Prerequisite: STAT 409 or STAT 410 or equivalent; credit or concurrent registration in MATH 471."}, {"id":"172","identifier":"MATH 574","department_id":"118","name":"Set Theory","credit":"Credit: 4 hours.","description":"Zermelo-Fraenkel axiomatic set theory; basic concepts in set theory such as ordinal, cardinal, rank, and definition by transfinite recursion; Godel's constructible universe; introduction to forcing; Boolean valued universes; large cardinals; consistency and independence of the continuum hypothesis and the axiom of choice. \nPrerequisite: MATH 570 or consent of instructor."}, {"id":"173","identifier":"MATH 583","department_id":"118","name":"Partial Orders and Comb Optim","credit":"Credit: 4 hours.","description":"Combinatorial aspects of partially ordered sets and their relation to optimization problems. Structure of posets and lattices, Dilworth's theorem and generalizations, linear extensions and sorting, dimension of posets, order ideals, extremal set theory, integer programming and minmax relations, matroids and their applications. \nPrerequisite: MATH 580 or consent of instructor."}, {"id":"174","identifier":"MATH 589","department_id":"118","name":"Conjugate Duality and Optim","credit":"Credit: 4 hours.","description":"Convex analysis for constrained extremum problems; convex sets, cones, and functions; separation; Fenchel transform; duality correspondences; differential theory; nonlinear programming; sensitivity; and perturbational duality for primal, dual, and Lagrangian problems. \nPrerequisite: MATH 415 and MATH 447, or consent of instructor."}, {"id":"175","identifier":"MATH 593","department_id":"118","name":"Mathematical Internship","credit":"Credit: 0 hours.","description":"Full-time or part-time practice of graduate-level mathematics in an off-campus government, industrial, or research laboratory environment. Summary report required. "}, {"id":"176","identifier":"MATH 595","department_id":"118","name":"Advanced Topics in Math","credit":"Credit: 1 TO 4 hours.","description":"\nMay be repeated in the same or separate semesters. Prerequisite: Consent of instructor."}, {"id":"177","identifier":"MATH 597","department_id":"118","name":"Reading Course","credit":"Credit: 1 TO 8 hours.","description":"\nApproved for both letter and S\/U grading. May be repeated in the same or separate terms to a maximum of 8 hours. Prerequisite: Consent of instructor."}, {"id":"178","identifier":"MATH 598","department_id":"118","name":"Literature Seminar in Math","credit":"Credit: 0 TO 4 hours.","description":"Seminar on topics of current interest in mathematics. Students present seminars and discussions on various topics. See Class Schedule for current topics. Recommended for all Mathematics students. \nApproved for both letter and S\/U grading. May be repeated as topics vary. Prerequisite: Consent of instructor."}, {"id":"179","identifier":"PHYS 100","department_id":"139","name":"Thinking About Physics","credit":"Credit: 1 or 2 hours.","description":"Conceptual and problem solving skills in preparation for PHYS 211. Part I (first eight weeks, 1 credit hour): analysis and mathematical descriptions of physical situations; understanding the meaning of the solutions. Part II (remainder of term, 2 credit hours for full term): development of problem solving skills and content from Part I. \nApproval of the department is required to register. Prerequisite: Credit or concurrent registration in MATH 220 or MATH 221."}, {"id":"180","identifier":"PHYS 101","department_id":"139","name":"College Physics: Mech & Heat","credit":"Credit: 5 hours.","description":"Newton's Laws, work and energy, rotational motion, fluids, thermodynamics, and waves. A noncalculus-based approach for majors in the life sciences, preprofessional health programs, agriculture, and veterinary medicine. \nCredit is not given for both PHYS 101 and either PHYS 211 or PHYS 213. Prerequisite: Trigonometry."}, {"id":"181","identifier":"PHYS 102","department_id":"139","name":"College Physics: E&M & Modern","credit":"Credit: 5 hours.","description":"Electric forces and fields, electric potential, electric circuits, magnetic forces and fields, geometrical optics, relativity,  and modern physics. A noncalculus-based approach for majors in the life sciences, preprofessional health programs, agriculture, and veterinary medicine. \nCredit is not given for both PHYS 102 and either PHYS 212 or PHYS 214. Prerequisite: PHYS 101."}, {"id":"182","identifier":"PHYS 123","department_id":"139","name":"Physics Made Easy","credit":"Credit: 3 hours.","description":"Inquiry-based, nonmathematical, hands-on study of physics for elementary school teachers. Coverage of most of the National Science Education K-4 Content Standards. "}, {"id":"183","identifier":"PHYS 150","department_id":"139","name":"Physics of Societal Issues","credit":"Credit: 3 hours.","description":"Physics topics and applications relevant in the modern world: energy, quantum mechanics, electricity and magnetism, nuclear physics, waves, light, and outer space. Application to satellites, alternative energy, medical imaging, radiation, nuclear weapons, climate change, and electronics. Emphasis on analytical thinking and the applicability to modern societal issues."}, {"id":"184","identifier":"PHYS 199","department_id":"139","name":"Undergraduate Open Seminar","credit":"Credit: 0 TO 5 hours.","description":""}, {"id":"185","identifier":"PHYS 211","department_id":"139","name":"University Physics: Mechanics","credit":"Credit: 4 hours.","description":"Newton's Laws, work and energy, static properties and fluids, oscillations, transverse waves, systems of particles, and rotations. A calculus-based approach for majors in engineering, mathematics, physics and chemistry. \nCredit is not given for both PHYS 211 and PHYS 101. Prerequisite: Credit or concurrent registration in MATH 231."}, {"id":"186","identifier":"PHYS 212","department_id":"139","name":"University Physics: Elec & Mag","credit":"Credit: 4 hours.","description":"Coulomb's Law, electric fields, Gauss' Law, electric potential, capacitance, circuits, magnetic forces and fields, Ampere's law, induction, electromagnetic waves, polarization, and geometrical optics. A calculus-based approach for majors in engineering, mathematics, physics, and chemistry. \nCredit is not given for both PHYS 212 and PHYS 102. Prerequisite: PHYS 211; credit or concurrent registration in MATH 241."}, {"id":"187","identifier":"PHYS 213","department_id":"139","name":"Univ Physics: Thermal Physics","credit":"Credit: 2 hours.","description":"First and second laws of thermodynamics including kinetic theory of gases, heat capacity, heat engines, introduction to entropy and statistical mechanics, and introduction to application of free energy and Boltzmann factor. A calculus-based approach for majors in engineering, mathematics, physics and chemistry. \nCredit is not given for both PHYS 213 and PHYS 101. Prerequisite: PHYS 211; credit or concurrent registration in MATH 241."}, {"id":"188","identifier":"PHYS 214","department_id":"139","name":"Univ Physics: Quantum Physics","credit":"Credit: 2 hours.","description":"Interference and diffraction, photons and matter waves, the Bohr atom, uncertainty principle, and wave mechanics. A calculus-based course for majors in engineering, mathematics, physics, and chemistry. \nCredit is not given for both PHYS 214 and PHYS 102. Prerequisite: PHYS 212."}, {"id":"189","identifier":"PHYS 221","department_id":"139","name":"Enrichment Mechanics","credit":"Credit: 1 hours.","description":"Supplement to PHYS 211 with a collaborative group learning approach to improving conceptual understanding and problem solving in introductory calculus-based mechanics. \nPrerequisite: PHYS 100; concurrent registration in PHYS 211."}, {"id":"190","identifier":"PHYS 225","department_id":"139","name":"Relativity & Math Applications","credit":"Credit: 2 hours.","description":"Theory of Special Relativity, with applications to kinematics and dynamics. Key mathematical methods as they apply to aspects of electromagnetic theory and classical mechanics, including vector analysis, series expansions, matrices, Fourier analysis, partial differentiation, three-dimensional calculus, and simple differential equations. \nPrerequisite: Credit or concurrent registration in PHYS 212."}, {"id":"191","identifier":"PHYS 280","department_id":"139","name":"Nuclear Weapons & Arms Control","credit":"Credit: 3 hours.","description":"Nontechnical analysis of the physics of nuclear weapons, nuclear weapon effects, delivery systems, and defenses against nuclear attack; presentation of current issues; basis for making informed judgments about nuclear armaments and arms control. "}, {"id":"192","identifier":"PHYS 325","department_id":"139","name":"Classical Mechanics I","credit":"Credit: 3 hours.","description":"Kinematics and dynamics of classical systems, including a review of Newtonian kinematics and dynamics. Three dimensional motion, variable mass, and conservation laws; damped and periodically driven oscillations; gravitational potential of extended objects and motion in rotating frames of reference; Lagrangian and Hamiltonian mechanics. \nPrerequisite: PHYS 225; credit or concurrent registration in MATH 285."}, {"id":"193","identifier":"PHYS 326","department_id":"139","name":"Classical Mechanics II","credit":"Credit: 3 hours.","description":"Continuation of PHYS 325. Central force motion, collisions and scattering, rotational motion, coupled oscillations, continuous media, and fluid dynamics. \nPrerequisite: PHYS 325."}, {"id":"194","identifier":"PHYS 401","department_id":"139","name":"Classical Physics Lab","credit":"Credit: 3 hours.","description":"Experiments and techniques in classical mechanics and electromagnetism. Dynamics of electrical and mechanical oscillators in the linear domain. Fourier analysis of system response. Measurements of electrostatic fields, transmission lines, waves, and radiation. Electromagnetic phenomena in dielectrics, conductors, and magnetic materials. Instruction in data analysis and report writing. \n3 undergraduate hours. 3 graduate hours. Prerequisite: Credit or concurrent enrollment in PHYS 325."}, {"id":"195","identifier":"PHYS 402","department_id":"139","name":"Light","credit":"Credit: 3 or 4 hours.","description":"Wave kinematics; geometrical optics: basic concepts, ray-tracing and matrix formalism, Gaussian imaging by thick lenses, stops, apertures, and intensity relations; interference; interference spectroscopy and coherence; diffraction: Fresnel-Kirchhoff formulation, Fraunhofer case, Fresnel case, and holography; polarized light. \n4 undergraduate hours. 3 or 4 graduate hours. (3 hours without lab). Prerequisite: MATH 285; PHYS 102 or PHYS 214."}, {"id":"196","identifier":"PHYS 403","department_id":"139","name":"Modern Experimental Physics","credit":"Credit: 4 OR 5 hours.","description":"Techniques and experiments in the physics of atoms, atomic nuclei, molecules, the solid state, and other areas of modern physical research. \n5 undergraduate hours. 4 graduate hours. Prerequisite: Credit or concurrent registration in PHYS 486."}, {"id":"197","identifier":"PHYS 406","department_id":"139","name":"Acoustical Physics of Music","credit":"Credit: 4 hours.","description":"Acoustical physics associated with music and musical instruments, propagation of sound waves in and from musical instruments, and the biological physics of human hearing. Investigation of topics via advanced laboratory and data acquisition techniques. \n4 undergraduate hours. 4 graduate hours. Prerequisite: PHYS 213 and PHYS 214."}, {"id":"198","identifier":"PHYS 419","department_id":"139","name":"Space, Time, and Matter-ACP","credit":"Credit: 3 OR 4 hours.","description":"Identical to PHYS 420 except for the additional writing component including a final term paper. \nSame as PHIL 419. 3 undergraduate hours. 4 graduate hours. Credit is not given for both PHYS 419 and PHYS 420. Prerequisite: PHIL 101; PHYS 101 or PHYS 211."}, {"id":"199","identifier":"PHYS 420","department_id":"139","name":"Space, Time, and Matter","credit":"Credit: 2 hours.","description":"Philosophical examination of some fundamental concepts and theories of the physical world, such as time, matter, space, and geometry; interpretation of quantum theory. \nSame as PHIL 420. 2 undergraduate hours. 2 graduate hours. Credit is not given for both PHYS 420 and PHYS 419. Prerequisite: PHIL 101; PHYS 101 or PHYS 211."}, {"id":"200","identifier":"PHYS 427","department_id":"139","name":"Thermal & Statistical Physics","credit":"Credit: 4 hours.","description":"Equilibrium thermodynamics, statistical mechanics, and kinetic theory of gases. A unified treatment is used in that the principles of heat and thermodynamics are discussed along with statistical postulates and the microscopic approach of introductory quantum mechanics. \n4 undergraduate hours. 4 graduate hours. Credit is not given for both PHYS 427 and any of ME 404, CHEM 444, MSE 500. Prerequisite: PHYS 213, PHYS 214, and PHYS 325."}, {"id":"201","identifier":"PHYS 435","department_id":"139","name":"Electromagnetic Fields I","credit":"Credit: 3 hours.","description":"Static electric and magnetic fields, their interactions with electric charge and current, and their transformation properties; the effect of special relativity is incorporated. Macroscopic fields in material media are described. \n3 undergraduate hours. 3 graduate hours. Prerequisite: MATH 285; credit or concurrent enrollment in PHYS 325."}, {"id":"202","identifier":"PHYS 436","department_id":"139","name":"Electromagnetic Fields II","credit":"Credit: 3 hours.","description":"Time-dependent fields. Electromagnetic induction, Maxwell's equations, electromagnetic wave propagation in various media and structures, and electromagnetic radiation from charge and current distributions. Relativistic covariance of Maxwell's equations.  \nundergraduate hours. 3 graduate hours. Prerequisite: PHYS 435."}, {"id":"203","identifier":"PHYS 470","department_id":"139","name":"Subatomic Physics","credit":"Credit: 4 hours.","description":"The nature and properties of nuclei and elementary particles, symmetries, interactions, nuclear models, tools and techniques of experimental subatomic physics, and applications to power generation, astrophysics, chemistry, medicine, and biology. \n4 undergraduate hours. 4 graduate hours. Prerequisite: PHYS 485 or PHYS 486."}, {"id":"204","identifier":"PHYS 486","department_id":"139","name":"Quantum Physics I","credit":"Credit: 4 hours.","description":"Atomic phenomena integrated with an introduction to quantum theory; evidence for the atomic nature of matter and the properties of the Schrodinger equation, single particle solutions in one dimension, the hydrogen atom, perturbation theory, external fields, and atomic spectroscopy of outer electrons. \n4 undergraduate hours. 4 graduate hours. Prerequisite: MATH 285; PHYS 214; credit or concurrent registration in MATH 415."}, {"id":"205","identifier":"PHYS 487","department_id":"139","name":"Quantum Physics II","credit":"Credit: 4 hours.","description":"Continuation of PHYS 486. Identical particles, spectral hyperfine structure, magnetic properties of matter, atomic spectroscopy of inner electrons, high-energy photon effects, molecular binding and spectra, emission and absorption of light, and symmetry principles. \n4 undergraduate hours. 4 graduate hours. Prerequisite: PHYS 486."}, {"id":"206","identifier":"PHYS 496","department_id":"139","name":"Intro to Physics Research","credit":"Credit: 3 hours.","description":"Examination of current research topics through extensive reading, writing, and oral-presentation activities. "}, {"id":"207","identifier":"PHYS 497","department_id":"139","name":"Individual Study","credit":"Credit: 1 TO 4 hours.","description":"Individual study at an advanced level in a subject not covered by course offerings. \n1 to 4 undergraduate hours. 1 to 4 graduate hours. May be repeated. Prerequisite: Consent of instructor."}, {"id":"208","identifier":"PHYS 498","department_id":"139","name":"Special Topics in Physics","credit":"Credit: 1 TO 4 hours.","description":"Subject offerings of new and developing areas of knowledge in physics intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}, {"id":"209","identifier":"PHYS 504","department_id":"139","name":"Statistical Physics","credit":"Credit: 4 hours.","description":"Single-particle distribution functions; classical and quantum mechanical systems, Boltzmann equation, virial theorem, and equations of state for gases; formal theory: ensembles, identical particles, thermodynamics of simple systems, and distribution functions; nonequilibrium problems; conservation laws and hydrodynamic equations, sound waves, and transport coefficients; plasmas, normal Fermi fluid, superfluids, and systems with internal degrees of freedom. \nPrerequisite: PHYS 427 and PHYS 486."}, {"id":"210","identifier":"PHYS 509","department_id":"139","name":"Mathematical Physics II","credit":"Credit: 4 hours.","description":"Continuation of PHYS 508. Further core techniques of mathematical physics widely used in the physical sciences. Complex variables; group theory in classical and quantum systems; tensors in physics; differential forms and their applications in mechanics; electromagnetism. \nPrerequisite: PHYS 508."}, {"id":"211","identifier":"PHYS 513","department_id":"139","name":"Quantum Optics & Information","credit":"Credit: 4 hours.","description":"Experimental and theoretical fundamentals of quantum information, using nonclassical features of quantum physics (wave-particle duality, superposition, and entanglement) to surpass the information-processing capabilities of classical systems. Underlying fundamental quantum phenomena, including tests of nonlocality, quantum erasers, the quantum Zeno effect, squeezed light, multi-particle interference, state transformations of the Bloch sphere, and decoherence; quantum cryptography and teleportation; quantum information theory; quantum computation algorithms and techniques for error correction; experimental \"qubit\" systems. \nPrerequisite: Recommended: PHYS 580."}, {"id":"212","identifier":"PHYS 516","department_id":"139","name":"General Relativity II","credit":"Credit: 4 hours.","description":"Continuation of PHYS 515 with emphasis on applications to astrophysics and cosmology. Relativistic stars, gravitational collapse, black holes, gravitational waves, numerical relativity, and cosmology. \nSame as ASTR 516. Prerequisite: PHYS 515."}, {"id":"213","identifier":"PHYS 560","department_id":"139","name":"Condensed Matter Physics I","credit":"Credit: 4 hours.","description":"Crystalline perfection, free-electron gas, screening, plasma oscillations, and dielectric response; Bloch electrons, Brillouin zones, and band structure; semiconductors, intrinsic and extrinsic, with applications; phonons, elasticity, and anharmonicity; ferromagnetism and second-order phase transitions; superconductivity. \nPrerequisite: PHYS 427 and PHYS 580."}, {"id":"214","identifier":"PHYS 575","department_id":"139","name":"Particle Physics I","credit":"Credit: 4 hours.","description":"Basic calculations in elementary particle theory. Quantum electrodynamics, quantum chromodynamics, and the Glashow-Weinberg-Salam theory of weak and electromagnetic interactions as applied to the phenomenology of particle decays and high energy reactions. \nPrerequisite: PHYS 570. Recommended: credit or concurrent registration in PHYS 582."}, {"id":"215","identifier":"PHYS 581","department_id":"139","name":"Quantum Mechanics II","credit":"Credit: 4 hours.","description":"Spin and identical particles, simple many-particle systems and elements of second-quantization theory; time-dependent processes, radiative transitions, and quantization of the electromagnetic field; scattering of particles with spin; polarization; introduction to the Klein-Gordon and Dirac equations and properties of simple relativistic systems. \nPrerequisite: PHYS 580."}, {"id":"216","identifier":"PHYS 583","department_id":"139","name":"Advanced Field Theory","credit":"Credit: 4 hours.","description":"Quantization and Feynman path integral; gauge theories and renormalization; renormalization group with applications to particle physics and critical phenomena; approximation methods and recent developments. \nPrerequisite: PHYS 582."}, {"id":"217","identifier":"PHYS 597","department_id":"139","name":"Individual Study","credit":"Credit: 1 TO 16 hours.","description":"Individual study in a subject not covered in course offerings may be arranged for credit by registration under this number. \nMay be repeated. 2 to 16 hours for full term; 1 to 8 hours for half-term. Prerequisite: Consent of instructor."}, {"id":"218","identifier":"PHYS 598","department_id":"139","name":"Special Topics in Physics","credit":"Credit: 1 TO 4 hours.","description":"Subject offerings of new and developing areas of knowledge in physics intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}, {"id":"219","identifier":"ECE 110","department_id":"57","name":"Introduction to Electronics","credit":"Credit: 1 to 3 hours.","description":"Introduction to selected fundamental concepts and principles in electrical engineering. Emphasis on measurement, modeling, and analysis of circuits and electronics while introducing numerous applications. Includes sub-discipline topics of electrical and computer engineering, for example, electromagnetics, control, signal processing, microelectronics, communications, and scientific computing basics. Lab work incorporates sensors and motors into an autonomous moving vehicle, designed and constructed to perform tasks jointly determined by the instructors and students."}, {"id":"220","identifier":"ECE 120","department_id":"57","name":"Introduction to Computing","credit":"Credit: 4 hours.","description":"Introduction to digital logic, computer systems, and computer languages. Topics include representation of information, combinational and sequential logic analysis and design, finite state machines, the von Neumann model, basic computer organization, and machine language programming. Laboratory assignments provide hands-on experience with design, simulation, implementation, and programming of digital systems. \nCredit is not given for both ECE 120 and CS 233. Prerequisite: Restricted to Computer Engineering or Electrical Engineering majors or transfer students with ECE Department consent."}, {"id":"221","identifier":"ECE 199","department_id":"57","name":"Undergraduate Open Seminar","credit":"Credit: 1 to 5 hours.","description":""}, {"id":"222","identifier":"ECE 200","department_id":"57","name":"Seminar","credit":"Credit: 0 hours.","description":"Discussions of educational programs, career opportunities, and other topics in electrical and computer engineering. "}, {"id":"223","identifier":"ECE 205","department_id":"57","name":"Elec & Electronic Circuits","credit":"Credit: 3 hours.","description":"Basic principles of circuit analysis; transient analysis; AC steady-state analysis; introduction to semiconductor devices and fabrication; digital logic circuits; op-amps; A\/D and D\/A conversion. \nCredit is not given to Computer or Electrical Engineering majors. Prerequisite: PHYS 212."}, {"id":"224","identifier":"ECE 206","department_id":"57","name":"Elec & Electronic Circuits Lab","credit":"Credit: 1 hours.","description":"Laboratory instruments and basic measurement techniques; electric circuits; CMOS logic circuits; DTL and TTL circuits; op-amps. \nCredit is not given to Computer or Electrical Engineering majors. Prerequisite: PHYS 212; concurrent registration in ECE 205."}, {"id":"225","identifier":"ECE 210","department_id":"57","name":"Analog Signal Processing","credit":"Credit: 4 hours.","description":"Analog signal processing, with an emphasis on underlying concepts from circuit and system analysis: linear systems; review of elementary circuit analysis; differential equation models of linear circuits and systems; Laplace transform; convolution; stability; phasors; frequency response; Fourier series; Fourier transform; active filters; AM radio. \nCredit is not given for both ECE 210 and ECE 211. Prerequisite: ECE 110 and PHYS 212; credit or concurrent registration in MATH 285 or MATH 286."}, {"id":"226","identifier":"ECE 211","department_id":"57","name":"Analog Circuits & Systems","credit":"Credit: 2 hours.","description":"Concepts from circuit and system analysis: linear systems; review of elementary circuit analysis; op amps; transient analysis; differential equation models of linear circuits and systems; Laplace transform. \nCredit is not given for both ECE 211 and ECE 210. Prerequisite: ECE 110 and PHYS 212; credit or concurrent registration in MATH 285 or MATH 286."}, {"id":"227","identifier":"ECE 220","department_id":"57","name":"Computer Systems & Programming","credit":"Credit: 4 hours.","description":"Advanced use of LC-3 assembly language for I\/O and function calling convention. C programming, covering basic programming concepts, functions, arrays, pointers, I\/O, recursion, simple data structures, linked lists, dynamic memory management, and basic algorithms. Information hiding and object-oriented design as commonly implemented in modern software and computer systems programming. \nPrerequisite: ECE 120. Restricted to Computer Engineering or Electrical Engineering majors or transfer students with ECE Department consent."}, {"id":"228","identifier":"ECE 297","department_id":"57","name":"Individual Study","credit":"Credit: 1 hours.","description":"Individual projects. Approved written application to department as specified by department or instructors is required. \nApproved for both letter and S\/U grading. May be repeated in separate terms to a maximum of 2 hours. Prerequisite: Consent of instructor."}, {"id":"229","identifier":"ECE 307","department_id":"57","name":"Techniques for Engrg Decisions","credit":"Credit: 3 hours.","description":"Modeling of decisions in engineering work and the analysis of models to develop a systematic approach to making decisions. Fundamental concepts in linear and dynamic programming; probability theory; and statistics. Resource allocation; logistics; scheduling; sequential decision making; siting of facilities; investment decisions; application of financial derivatives; other problems for decision making under uncertainty. Case studies from actual industrial applications illustrate real-world decisions. \nPrerequisite: ECE 210; credit or concurrent registration in ECE 313."}, {"id":"230","identifier":"ECE 310","department_id":"57","name":"Digital Signal Processing","credit":"Credit: 3 hours.","description":"Introduction to discrete-time systems and discrete-time signal processing with an emphasis on causal systems; discrete-time linear systems, difference equations, z-transforms, discrete convolution, stability, discrete-time Fourier transforms, analog-to-digital and digital-to-analog conversion, digital filter design, discrete Fourier transforms, fast Fourier transforms, spectral analysis, and applications of digital signal processing. \nPrerequisite: ECE 210."}, {"id":"231","identifier":"ECE 311","department_id":"57","name":"Digital Signal Processing Lab","credit":"Credit: 1 hours.","description":"Companion laboratory for ECE 310. \nPrerequisite: Credit or concurrent registration in ECE 310."}, {"id":"232","identifier":"ECE 313","department_id":"57","name":"Probability with Engrg Applic","credit":"Credit: 3 hours.","description":"Probability theory with applications to engineering problems such as the reliability of circuits and systems to statistical methods for hypothesis testing, decision making under uncertainty, and parameter estimation. \nSame as MATH 362. Credit is not given for both ECE 313 and MATH 461. Prerequisite: MATH 286 or MATH 415."}, {"id":"233","identifier":"ECE 316","department_id":"57","name":"Ethics and Engineering","credit":"Credit: 3 hours.","description":"Ethical issues in the practice of engineering: safety and liability, professional responsibility to clients and employers, whistle-blowing, codes of ethics, career choice, and legal obligations. Philosophical analysis of normative ethical theories. Case studies. \nSame as PHIL 316. Credit is not given for both ECE 316 and CS 210. Junior standing is required. Prerequisite: RHET 105."}, {"id":"234","identifier":"ECE 317","department_id":"57","name":"ECE Technology & Management","credit":"Credit: 3 hours.","description":"Basic understanding of electrical and computer engineering concepts applicable to technology management. Circuit components; dc fundamentals; ac fundamentals; semiconductors; operational amplifiers; device fabrication; power distribution; digital devices; computer architecture (including microprocessors). Intended for the Business Majors in the Technology and Management program. \nCredit is not given to Computer or Electrical Engineering majors. Prerequisite: One of MATH 220, MATH 221, MATH 234."}, {"id":"235","identifier":"ECE 329","department_id":"57","name":"Fields and Waves I","credit":"Credit: 3 hours.","description":"Electromagnetic fields and waves fundamentals and their engineering applications: static electric and magnetic fields; energy storage; Maxwell's equations for time-varying fields; wave solutions in free space, dielectrics and conducting media, transmission line systems; time- and frequency-domain analysis of transmission line circuits and Smith chart applications. \nPrerequisite: ECE 210."}, {"id":"236","identifier":"ECE 330","department_id":"57","name":"Power Ckts & Electromechanics","credit":"Credit: 3 hours.","description":"Network equivalents; power and energy fundamentals, resonance, mutual inductance; three-phase power concepts, forces and torques of electric origin in electromagnetic and electrostatic systems; energy conversion cycles; principles of electric machines; transducers; relays; laboratory demonstration. \nPrerequisite: ECE 210."}, {"id":"237","identifier":"ECE 333","department_id":"57","name":"Green Electric Energy","credit":"Credit: 3 hours.","description":"Electric power grid structure and policy; analysis of wind, solar, and fuels as raw resources; wind turbines and parks; solar cells, modules, arrays and systems; fuel cell power plants; energy and financial performance of green energy projects; integration of green energy into power grid; energy project report and presentation. \nPrerequisite: ECE 205 or ECE 210."}, {"id":"238","identifier":"ECE 340","department_id":"57","name":"Semiconductor Electronics","credit":"Credit: 3 hours.","description":"Modern device electronics: semiconductor fundamentals including crystals and energy bands, charge carriers (electrons and holes), doping, and transport, (drift and diffusion); unipolar devices with the MOS field effect transistor as a logic device and circuit considerations; basic concepts of generation-recombination and the P-N junction as capacitors and current rectifier with applications in photonics; bipolar transistors as amplifiers and switching three-terminal devices. \nPrerequisite: ECE 210; PHYS 214; credit or concurrent registration in ECE 329."}, {"id":"239","identifier":"ECE 342","department_id":"57","name":"Electronic Circuits","credit":"Credit: 3 hours.","description":"Analysis and design of analog and digital electronic circuits using MOS field effect transistors and bipolar junction transistors, with emphasis on amplifiers in integrated circuits. \nCredit is not given for both ECE 342 and PHYS 404. Prerequisite: ECE 210."}, {"id":"240","identifier":"ECE 343","department_id":"57","name":"Electronic Circuits Laboratory","credit":"Credit: 1 hours.","description":"Companion laboratory for ECE 342. \nCredit is not given for both ECE 343 and PHYS 404. Prerequisite: Credit or concurrent registration in ECE 342."}, {"id":"241","identifier":"ECE 350","department_id":"57","name":"Fields and Waves II","credit":"Credit: 3 hours.","description":"Continuation of ECE 329: radiation theory; antennas, radiation fields, radiation resistance and gain; transmitting arrays; plane-wave approximation of radiation fields; plane-wave propagation, reflection, and transmission; Doppler effect, evanescent waves and tunneling, dispersion, phase and group velocities; waveguides and resonant cavities; antenna reception and link budgets. \nPrerequisite: ECE 329."}, {"id":"242","identifier":"ECE 361","department_id":"57","name":"Digital Communications","credit":"Credit: 3 hours.","description":"Reliable communication of one bit of information over three types of channels: additive Gaussian noise, wireline, and wireless. Emphasis on the impact of bandwidth and power on the data rate and reliability, using discrete-time models. Technological examples used as case studies. \nPrerequisite: ECE 210 and ECE 313."}, {"id":"243","identifier":"ECE 385","department_id":"57","name":"Digital Systems Laboratory","credit":"Credit: 3 hours.","description":"Design, build, and test digital systems using transistor-transistor logic (TTL), SystemVerilog, and field-programmable gate arrays (FPGAs). Topics include combinational and sequential logic, storage elements, input\/output and display, timing analysis, design tradeoffs, synchronous and asynchronous design methods, datapath and controller, microprocessor design, software\/hardware co-design, and system-on-a-chip. \nPrerequisite: ECE 110 and ECE 220."}, {"id":"244","identifier":"ECE 391","department_id":"57","name":"Computer Systems Engineering","credit":"Credit: 4 hours.","description":"Concepts and abstractions central to the development of modern computing systems, with an emphasis on the systems software that controls interaction between devices and other hardware and application programs. Input-output semantics; synchronization; interrupts; multitasking; virtualization of abstractions. Term-based projects. \nCredit is not given for both ECE 391 and CS 241. Prerequisite: ECE 220 or CS 233."}, {"id":"245","identifier":"ECE 395","department_id":"57","name":"Advanced Digital Projects Lab","credit":"Credit: 2 OR 3 hours.","description":"Planning, designing, executing, and documenting a microcomputer-based project. Emphasis on hardware but special projects may require an equal emphasis on software. \nPrerequisite: ECE 385."}, {"id":"246","identifier":"ECE 396","department_id":"57","name":"Honors Project","credit":"Credit: 1 TO 4 hours.","description":"Special project or reading course for James Scholars in engineering. \nMay be repeated. Prerequisite: Consent of instructor."}, {"id":"247","identifier":"ECE 397","department_id":"57","name":"Individual Study in ECE","credit":"Credit: 0 TO 4 hours.","description":"Individual Projects. \nApproved for both letter and S\/U grading. May be repeated. Prerequisite: Consent of instructor. Approved written application to department as specified by department or instructor is required."}, {"id":"248","identifier":"ECE 398","department_id":"57","name":"Special Topics in ECE","credit":"Credit: 0 TO 4 hours.","description":"Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}, {"id":"249","identifier":"ECE 402","department_id":"57","name":"Electronic Music Synthesis","credit":"Credit: 3 hours.","description":"Historical survey of electronic and computer music technology; parameters of musical expression and their codification; analysis and synthesis of fixed sound spectra; time-variant spectrum analysis\/synthesis of musical sounds; algorithms for dynamic sound synthesis. \n3 undergraduate hours. 3 graduate hours. Prerequisite: MUS 103, ECE 290, and ECE 310."}, {"id":"250","identifier":"ECE 403","department_id":"57","name":"Audio Engineering","credit":"Credit: 3 hours.","description":"Resonance and wave phenomena; acoustics of rooms and auditoriums; artificial reverberation and sound localization-spatialization; loudspeakers, enclosures, and microphones; topics in digital audio. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 290, ECE 310, and ECE 473."}, {"id":"251","identifier":"ECE 411","department_id":"57","name":"Computer Organization & Design","credit":"Credit: 4 hours.","description":"Basic computer organization and design: integer and floating-point computer arithmetic; control unit design; pipelining; system interconnect; memory organization; I\/O design; reliability and performance evaluation. Laboratory for computer design implementation, simulation, and layout. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 391 or CS 241."}, {"id":"252","identifier":"ECE 414","department_id":"57","name":"Biomedical Instrumentation","credit":"Credit: 3 hours.","description":""}, {"id":"253","identifier":"ECE 415","department_id":"57","name":"Biomedical Instrumentation Lab","credit":"Credit: 2 hours.","description":""}, {"id":"254","identifier":"ECE 417","department_id":"57","name":"Multimedia Signal Processing","credit":"Credit: 4 hours.","description":"Characteristics of speech and image signals; important analysis and synthesis tools for multimedia signal processing including subspace methods, Bayesian networks, hidden Markov models, and factor graphs; applications to biometrics (person identification), human-computer interaction (face and gesture recognition and synthesis), and audio-visual databases (indexing and retrieval). Emphasis on a set of MATLAB machine problems providing hands-on experience. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 310 and ECE 313."}, {"id":"255","identifier":"ECE 418","department_id":"57","name":"Image & Video Processing","credit":"Credit: 4 hours.","description":"Concepts and applications in image and video processing; introduction to multidimensional signal processing: sampling, Fourier transform, filtering, interpolation, and decimation; human visual perception; scanning and display of images and video; image enhancement, restoration and segmentation; digital image and video compression; image analysis. Laboratory exercises promote experience with topics and development of C and MATLAB programs. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 310; credit or concurrent registration in one of ECE 313, STAT 400, IE 300, MATH 461; MATH 415; experience with C programming language."}, {"id":"256","identifier":"ECE 419","department_id":"57","name":"Security Laboratory","credit":"Credit: 3 or 4 hours.","description":""}, {"id":"257","identifier":"ECE 420","department_id":"57","name":"Embedded DSP Laboratory","credit":"Credit: 2 hours.","description":"Development of real-time digital signal processing (DSP) systems using a DSP microprocessor; several structured laboratory exercises, such as sampling and digital filtering; followed by an extensive DSP project of the student's choice. \n2 undergraduate hours. 2 graduate hours. Prerequisite: ECE 310."}, {"id":"258","identifier":"ECE 422","department_id":"57","name":"Computer Security I","credit":"Credit: 3 or 4 hours.","description":""}, {"id":"259","identifier":"ECE 424","department_id":"57","name":"Computer Security II","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"260","identifier":"ECE 428","department_id":"57","name":"Distributed Systems","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"261","identifier":"ECE 431","department_id":"57","name":"Electric Machinery","credit":"Credit: 4 hours.","description":"Theory and laboratory experimentation with three-phase power, power-factor correction, single- and three-phase transformers, induction machines, DC machines, and synchronous machines; project work on energy control systems; digital simulation of machine dynamics. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 330."}, {"id":"262","identifier":"ECE 438","department_id":"57","name":"Communication Networks","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"263","identifier":"ECE 441","department_id":"57","name":"Physcs & Modeling Semicond Dev","credit":"Credit: 3 hours.","description":"Advanced concepts including generation-recombination, hot electron effects, and breakdown mechanisms; essential features of small ac characteristics, switching and transient behavior of p-n junctions, and bipolar and MOS transistors; fundamental issues for device modeling; perspective and limitations of Si-devices. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 340."}, {"id":"264","identifier":"ECE 444","department_id":"57","name":"IC Device Theory & Fabrication","credit":"Credit: 4 hours.","description":"Fabrication lab emphasizing physical theory and design of devices suitable for integrated circuitry; electrical properties of semiconductors and techniques (epitaxial growth, oxidation, photolithography diffusion, ion implantation, metallization, and characterization) for fabricating integrated circuit devices such as p-n junction diodes, bipolar transistors, and field effect transistors. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 340."}, {"id":"265","identifier":"ECE 445","department_id":"57","name":"Senior Design Project Lab","credit":"Credit: 4 hours.","description":"Individual design projects in various areas of electrical and computer engineering; projects are chosen by students with approval of instructor. A professionally kept lab notebook, a written report, prepared to journal publication standards, and an oral presentation required. "}, {"id":"266","identifier":"ECE 448","department_id":"57","name":"Artificial Intelligence","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"267","identifier":"ECE 453","department_id":"57","name":"Wireless Communication Systems","credit":"Credit: 4 hours.","description":"Design of a radio system for transmission of information; modulation, receivers, impedance matching, oscillators, two-port network analysis, receiver and antenna noise, nonlinear effects, mixers, phase-locked loops. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 329, credit or concurrent registration in ECE 342."}, {"id":"268","identifier":"ECE 454","department_id":"57","name":"Antennas","credit":"Credit: 3 hours.","description":"Antenna parameters; polarization of electromagnetic waves; basic antenna types; antenna arrays; broadband antenna design; antenna measurements. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 350."}, {"id":"269","identifier":"ECE 457","department_id":"57","name":"Microwave Devices & Circuits","credit":"Credit: 3 hours.","description":"Electromagnetic wave propagation, microwave transmission systems, passive components, microwave tubes, solid state microwave devices, microwave integrated circuits, S-parameter analysis, and microstrip transmission lines. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 340 and ECE 350."}, {"id":"270","identifier":"ECE 463","department_id":"57","name":"Digital Communications Lab","credit":"Credit: 2 hours.","description":"Hands-on experience in the configuration and performance evaluation of digital communication systems employing both radio and optical signals. \n2 undergraduate hours. 2 graduate hours. Prerequisite: ECE 361 or ECE 459."}, {"id":"271","identifier":"ECE 472","department_id":"57","name":"Biomedical Ultrasound Imaging","credit":"Credit: 3 hours.","description":"Theoretical and engineering foundations of ultrasonic imaging for medical diagnostics. Conventional, Doppler, and advanced ultrasonic imaging techniques; medical applications of different ultrasonic imaging techniques; engineering problems related to characterization of ultrasonic sources and arrays, image production, image quality, the role of contrast agents in ultrasonic imaging, and system design. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 329."}, {"id":"272","identifier":"ECE 473","department_id":"57","name":"Fund of Engrg Acoustics","credit":"Credit: 3 OR 4 hours.","description":"Development of the basic theoretical concepts of acoustical systems; mechanical vibration, plane and spherical wave phenomena in fluid media, lumped and distributed resonant systems, and absorption phenomena and hearing. \nSame as TAM 413. 3 undergraduate hours. 3 or 4 graduate hours. Prerequisite: MATH 285 or MATH 286."}, {"id":"273","identifier":"ECE 481","department_id":"57","name":"Nanotechnology","credit":"Credit: 3 OR 4 hours.","description":"Fundamental physical properties of nanoscale systems. Nanofabrication techniques, semiconductor nanotechnology, molecular and biomolecular nanotechnology, carbon nanotechnology (nanotubes and graphene), nanowires, and nanoscale architectures and systems. \n3 undergraduate hours. 4 graduate hours. Prerequisite: One of CHEM 442, CHBE 457, ME 485, MSE 401, PHYS 460."}, {"id":"274","identifier":"ECE 483","department_id":"57","name":"Analog IC Design","credit":"Credit: 3 hours.","description":"Basic linear integrated circuit design techniques using bi-polar, JFET, and MOS technologies; operational amplifiers; wide-band feedback amplifiers; sinusoidal and relaxation oscillators; electric circuit noise; application of linear integrated circuits. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 342."}, {"id":"275","identifier":"ECE 485","department_id":"57","name":"MEMS Devices & Systems","credit":"Credit: 3 hours.","description":"Introduction to principles, fabrication techniques, and applications of microelectromechanical systems (MEMS). In-depth analysis of sensors, actuator principles, and integrated microfabrication techniques for MEMS. Comprehensive investigation of state-of-the-art MEMS devices and systems. "}, {"id":"276","identifier":"ECE 486","department_id":"57","name":"Control Systems","credit":"Credit: 4 hours.","description":"Analysis and design of control systems with emphasis on modeling, state variable representation, computer solutions, modern design principles, and laboratory techniques. \n4 undergraduate hours. 4 graduate hours. Prerequisite: ECE 210."}, {"id":"277","identifier":"ECE 490","department_id":"57","name":"Introduction to Optimization","credit":"Credit: 3 OR 4 hours.","description":"Basic theory and methods for the solution of optimization problems; iterative techniques for unconstrained minimization; linear and nonlinear programming with engineering applications. \nSame as CSE 441. 3 undergraduate hours. 4 graduate hours. Prerequisite: ECE 190 and MATH 415."}, {"id":"278","identifier":"ECE 491","department_id":"57","name":"Numerical Analysis","credit":"Credit: 3 or 4 hours.","description":""}, {"id":"279","identifier":"ECE 493","department_id":"57","name":"Advanced Engineering Math","credit":"Credit: 3 OR 4 hours.","description":""}, {"id":"280","identifier":"ECE 495","department_id":"57","name":"Photonic Device Laboratory","credit":"Credit: 3 hours.","description":"Active photonic devices and lightwave technology. Hands-on experience with several classes of lasers (HeNe laser, semiconductor edge emitting lasers, vertical cavity surface emitting lasers), photodetectors, and photonic systems. Familiarization with experimental optical characterization techniques and equipment. \n3 undergraduate hours. 3 graduate hours. Prerequisite: ECE 487 recommended."}, {"id":"281","identifier":"ECE 496","department_id":"57","name":"Senior Research Project","credit":"Credit: 2 hours.","description":"Individual research project under the guidance of a faculty member: for example, mathematical analysis, laboratory experiments, computer simulations, software development, circuit design, or device fabrication. Preparation of a written research proposal, including preliminary results. \n2 undergraduate hours. No graduate credit. May be repeated. ECE 496 and ECE 499 taken in sequence fulfill the Advanced Composition Requirement. Prerequisite: RHET 105; consent of instructor."}, {"id":"282","identifier":"ECE 498","department_id":"57","name":"Special Topics in ECE","credit":"Credit: 0 TO 4 hours.","description":"Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}, {"id":"283","identifier":"ECE 499","department_id":"57","name":"Senior Thesis","credit":"Credit: 2 hours.","description":"Completion of the research project begun under ECE 496. Preparation and oral presentation of a written thesis that reports the results of the project. \n2 undergraduate hours. No graduate credit. To fulfill the Advanced Composition Requirement, credit must be earned for both ECE 496 and ECE 499. Prerequisite: ECE 496 and consent of instructor."}, {"id":"284","identifier":"ECE 500","department_id":"57","name":"ECE Colloquium","credit":"Credit: 0 hours.","description":"Required of all graduate students. "}, {"id":"285","identifier":"ECE 513","department_id":"57","name":"Vector Space Signal Processing","credit":"Credit: 4 hours.","description":"Mathematical tools in a vector space framework, including: finite and infinite dimensional vector spaces, Hilbert spaces, orthogonal projections, subspace techniques, least-squares methods, matrix decomposition, conditioning and regularizations, bases and frames, the Hilbert space of random variables, random processes, iterative methods; applications in signal processing, including inverse problems, filter design, sampling, interpolation, sensor array processing, and signal and spectral estimation. \nPrerequisite: ECE 310, ECE 313, and MATH 415."}, {"id":"286","identifier":"ECE 515","department_id":"57","name":"Control System Theory & Design","credit":"Credit: 4 hours.","description":"Feedback control systems emphasizing state space techniques. Basic principles, modeling, analysis, stability, structural properties, optimization, and design to meet specifications. \nSame as ME 540. Prerequisite: ECE 486."}, {"id":"287","identifier":"ECE 523","department_id":"57","name":"Gaseous Electronics & Plasmas","credit":"Credit: 4 hours.","description":"Basic concepts and techniques, both theoretical and experimental, applicable to gaseous electronics, gas and solid plasmas, controlled fusion, aeronomy, gas lasers, and magnetohydrodynamics. \nPrerequisite: ECE 452 or PHYS 485."}, {"id":"288","identifier":"ECE 528","department_id":"57","name":"Analysis of Nonlinear Systems","credit":"Credit: 4 hours.","description":"Nonlinear dynamics, vector fields and flows, Lyapunov stability theory, regular and singular perturbations, averaging, integral manifolds, input-output and input-to-state stability, and various design applications in control systems and robotics. \nSame as GE 520 and ME 546. Prerequisite: ECE 515 and MATH 444 or MATH 447."}, {"id":"289","identifier":"ECE 534","department_id":"57","name":"Random Processes","credit":"Credit: 4 hours.","description":"Basic concepts of random processes; linear systems with random inputs; Markov processes; spectral analysis; Wiener and Kalman filtering; applications to systems engineering. \nPrerequisite: One of ECE 313, MATH 461, STAT 400."}, {"id":"290","identifier":"ECE 536","department_id":"57","name":"Integ Optics & Optoelectronics","credit":"Credit: 4 hours.","description":"Integrated optical and optoelectronic devices; theory of optical devices including laser sources, waveguides, photodetectors, and modulations of these devices. \nPrerequisite: One of ECE 455, ECE 487, PHYS 486. Recommended: ECE 488."}, {"id":"291","identifier":"ECE 540","department_id":"57","name":"Computational Electromagnetics","credit":"Credit: 4 hours.","description":"Basic computational techniques for numerical analysis of electromagnetics problems, including the finite difference, finite element, and moment methods. Emphasis on the formulation of physical problems into mathematical boundary-value problems, numerical discretization of continuous problems into discrete problems, and development of rudimentary computer codes for simulation of electromagnetic fields in engineering problems using each of these techniques. \nSame as CSE 530. Prerequisite: CS 357; credit or concurrent registration in ECE 520."}, {"id":"292","identifier":"ECE 542","department_id":"57","name":"Fault-Tolerant Dig Syst Design","credit":"Credit: 4 hours.","description":"Advanced concepts in hardware and software fault tolerance: fault models, coding in computer systems, module and system level fault detection mechanism, reconfiguration techniques in multiprocessor systems and VLSI processor arrays, and software fault tolerance techniques such as recovery blocks, N-version programming, checkpointing, and recovery; survey of practical fault-tolerant systems. \nSame as CS 536. Prerequisite: ECE 411."}, {"id":"293","identifier":"ECE 546","department_id":"57","name":"Advanced Signal Integrity","credit":"Credit: 4 hours.","description":"Signal integrity aspects involved in the design of high-speed computers and high-frequency circuits; addressing the functions of limitations of interconnects for system-level integration. Topics explored include packaging structures, power and signal distribution, power level fluctuations, skin effect, parasitics, noise, packaging hierarch, multilayer wiring structures as well as the modeling and simulation of interconnects through the use of computer-aided design (CAD) and computational electromagnetics. \nPrerequisite: ECE 520."}, {"id":"294","identifier":"ECE 549","department_id":"57","name":"Computer Vision","credit":"Credit: 4 hours.","description":"Information processing approaches to computer vision, algorithms, and architectures for artificial intelligence and robotics systems capable of vision: inference of three-dimensional properties of a scene from its images, such as distance, orientation, motion, size and shape, acquisition, and representation of spatial information for navigation and manipulation in robotics. \nSame as CS 543. Prerequisite: ECE 448 or CS 225."}, {"id":"295","identifier":"ECE 550","department_id":"57","name":"Advanced Robotic Planning","credit":"Credit: 4 hours.","description":"Computational approaches to robot motion planning, configuration space, algebraic decompositions, artificial potential fields, retraction, approximate decompositions, planning under uncertainty, grasp planning, and task-level planning. \nSame as AE 583. Prerequisite: ECE 470."}, {"id":"296","identifier":"ECE 552","department_id":"57","name":"Numerical Circuit Analysis","credit":"Credit: 4 hours.","description":"Formulation of circuit equations; sparse matrix algorithms for the solution of large systems, AC, DC, and transient analysis of electrical circuits; sensitivity analysis; decomposition methods. \nSame as CSE 532. Prerequisite: MATH 415 and ECE 210."}, {"id":"297","identifier":"ECE 561","department_id":"57","name":"Detection & Estimation Theory","credit":"Credit: 4 hours.","description":"Detection and estimation theory, with applications to communication, control, and radar systems; decision-theory concepts and optimum-receiver principles; detection of random signals in noise, coherent and noncoherent detection; parameter estimation, linear and nonlinear estimation, and filtering. \nPrerequisite: ECE 534."}, {"id":"298","identifier":"ECE 564","department_id":"57","name":"Modern Light Microscopy","credit":"Credit: 4 hours.","description":"Current research topics in modern light microscopy: optics principles (statistical optics, Gaussian optics, elastic light scattering, dynamic light scattering); traditional microscopy (bright field, dark field, DIC, phase contract, confocal, epi-fluorescence, confocal fluorescence); current research topics (multiphoton, CARS, STED, FRET, FIONA, STORM, PALM, quantitative phase). \nPrerequisite: One of ECE 460, MSE 405, PHYS 402."}, {"id":"299","identifier":"ECE 574","department_id":"57","name":"Nanophotonics","credit":"Credit: 4 hours.","description":"Nanoscale interaction between light and semiconductors, metals, or composites; plasmonics, cavity electrodynamics, polarition cavity condensation, sub-wavelength structures, metamaterials, and applications. \nPrerequisite: ECE 455 or ECE 572; ECE 487 or PHYS 486."}, {"id":"300","identifier":"ECE 576","department_id":"57","name":"Power System Dynm & Stability","credit":"Credit: 4 hours.","description":"Detailed modeling of the synchronous machine and its controls, such as excitation system and turbine-governor dynamics; time-scales and reduced order models; non-linear and linear multi-machine models; stability analysis using energy functions; power system stabilizers. \nPrerequisite: ECE 476; credit or concurrent registration in ECE 530."}, {"id":"301","identifier":"ECE 579","department_id":"57","name":"Computational Complexity","credit":"Credit: 4 hours.","description":""}, {"id":"302","identifier":"ECE 584","department_id":"57","name":"Embedded System Verification","credit":"Credit: 4 hours.","description":"Examines formal analysis an synthesis approaches for discrete, continuous, and hybrid models of computing systems and their physical environment. Introduces timed and hybrid automata models. Analysis techniques including model checking, Hoare-style deduction, and abstractions for safety and stability, and controller synthesis strategies with applications in distributed robotics, automobile system, traffic control, and real-time systems. \nSame as CS 584. Prerequisite: CS 373 or CS 476 or CS 477."}, {"id":"303","identifier":"ECE 585","department_id":"57","name":"MOS Device Modeling & Design","credit":"Credit: 4 hours.","description":"Techniques for characterizing gate oxide and interface properties and reliability, I-V models for circuit simulation, design for control of short channel effects, silicon-on-insulator, and new device structures. \nPrerequisite: ECE 441."}, {"id":"304","identifier":"ECE 590","department_id":"57","name":"Grad Sem in Special Topics","credit":"Credit: 0 TO 2 hours.","description":"Lectures and discussions on current research and literature on advanced topics in electrical engineering. \nApproved for S\/U grading only. May be repeated. Prerequisite: Consent of instructor."}, {"id":"305","identifier":"ECE 594","department_id":"57","name":"Math Models of Language","credit":"Credit: 3 OR 4 hours.","description":"Mathematical models of linguistic structure and their implementation in computational algorithms used in automatic speech understanding and speech synthesis. Statistical and automata-theoretic techniques are studied allowing a quantitative description of acoustic-phonetics, phonology, phonotactics, lexicons, syntax, and semantics. The methods are used to build components of a speech understanding system. \nFor 4 hours credit, an extended project is required. Prerequisite: ECE 537."}, {"id":"306","identifier":"ECE 597","department_id":"57","name":"Individual Study in ECE","credit":"Credit: 1 TO 8 hours.","description":"Individual projects. Approved written application to department as specified by department or instructor is required. \nMay be repeated. Prerequisite: Consent of instructor."}, {"id":"307","identifier":"ECE 598","department_id":"57","name":"Special Topics in ECE","credit":"Credit: 0 TO 4 hours.","description":"Subject offerings of new and developing areas of knowledge in electrical and computer engineering intended to augment the existing curriculum. See Class Schedule or departmental course information for topics and prerequisites. "}]
